import os
from flask import Flask, render_template, request, jsonify, send_from_directory

app = Flask(__name__)


@app.route("/static/<path:filename>")
def static_files(filename):
    return send_from_directory(os.path.join(app.root_path, "static"), filename)

SCHEDULES = {
  "25人力资源管理【本科】1班": {
    "major": "人力资源管理【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "林方榕",
        "room": "7号楼B105"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "林樾",
        "room": "7号楼C204"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人力资源管理专业导论A",
        "teacher": "何金露",
        "room": "7号楼C302"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "江晓敏",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "人工智能导论",
        "teacher": "宋晓秋",
        "room": "7号楼C406"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "林樾",
        "room": "7号楼C204"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "林方榕",
        "room": "7号楼B105"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "江晓敏",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "万菊",
        "room": "7号楼C306"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人力资源管理专业导论A",
        "teacher": "何金露",
        "room": "7号楼C304"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "德法社会实践",
        "teacher": "万菊",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "郭超",
        "room": "7号楼C505"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "万菊",
        "room": "校外地点15"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "艺术基础素养",
        "teacher": "郭超",
        "room": "7号楼C505"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学体育（1）",
        "teacher": "江晓敏",
        "room": "田径运动场"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "万菊",
        "room": "7号楼C405"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "形势与政策（1）",
        "teacher": "林晓东",
        "room": "7号楼C201"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "林方榕",
        "room": "7号楼B105"
      },
      {
        "day": "周四",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "林晓东",
        "room": "7号楼C201"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "黄露",
        "room": "7号楼C306"
      }
    ]
  },
  "25人力资源管理【本科】2班": {
    "major": "人力资源管理【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "林樾",
        "room": "7号楼C204"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "宋晓秋",
        "room": "7号楼C406"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人力资源管理专业导论A",
        "teacher": "何金露",
        "room": "7号楼C302"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "林方榕",
        "room": "7号楼B105"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "林方榕",
        "room": "7号楼B105"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "林樾",
        "room": "7号楼C204"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "万菊",
        "room": "7号楼C306"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人力资源管理专业导论A",
        "teacher": "何金露",
        "room": "7号楼C304"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "林方榕",
        "room": "7号楼B105"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "万菊",
        "room": "7号楼C405"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "蔡昌文",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "林晓东",
        "room": "7号楼C201"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "郭超",
        "room": "7号楼C505"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "黄露",
        "room": "7号楼C306"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "艺术基础素养",
        "teacher": "郭超",
        "room": "7号楼C505"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "林晓东",
        "room": "7号楼C201"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "德法社会实践",
        "teacher": "万菊",
        "room": "9#501"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学英语（1）",
        "teacher": "林方榕",
        "room": "7号楼B105"
      },
      {
        "day": "周六",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "蔡昌文",
        "room": "田径运动场"
      },
      {
        "day": "周六",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "德法社会实践",
        "teacher": "万菊",
        "room": "校外地点13"
      }
    ]
  },
  "25会计学【本科】1班": {
    "major": "会计学【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "会计学原理A",
        "teacher": "吴思",
        "room": "4A503"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "郑美香",
        "room": "6B612-语音实验室(8)"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "会计学原理实训",
        "teacher": "韩春燕",
        "room": "4A405"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学日语（1）",
        "teacher": "林韵",
        "room": "4C104"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "大学日语（1）",
        "teacher": "林韵",
        "room": "4C104"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "任立民",
        "room": "4A501"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "夏博雯",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "李桃",
        "room": "11#413"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "会计学原理实训",
        "teacher": "韩春燕",
        "room": "4B408"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "陈浩",
        "room": "4A406"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "商务基础与专业导论A",
        "teacher": "林琳",
        "room": "4B410"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "会计学原理A",
        "teacher": "吴思",
        "room": "4A602"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "近现代史社会实践",
        "teacher": "李桃",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "李桃",
        "room": "11#413"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "人工智能导论",
        "teacher": "陈慧",
        "room": "4C314"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "陈浩",
        "room": "4A406"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "大学日语（1）",
        "teacher": "林韵",
        "room": "4C104"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "商务基础与专业导论A",
        "teacher": "林琳",
        "room": "4B408"
      },
      {
        "day": "周四",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "会计学原理实训",
        "teacher": "韩春燕",
        "room": "4B408"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "吴冰",
        "room": "4C104"
      }
    ]
  },
  "25会计学【本科】2班": {
    "major": "会计学【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "郑美香",
        "room": "4B412"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "商务基础与专业导论A",
        "teacher": "林琳",
        "room": "4A404"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "任立民",
        "room": "4A501"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "会计学原理A",
        "teacher": "吴思",
        "room": "4A503"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "张叶云",
        "room": "4C413"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "商务基础与专业导论A",
        "teacher": "林琳",
        "room": "4B410"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "郑美香",
        "room": "6B612-语音实验室(8)"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "陈浩",
        "room": "4A406"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "许金富",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "任立民",
        "room": "4A501"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "会计学原理A",
        "teacher": "吴思",
        "room": "4A602"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "陈浩",
        "room": "4A406"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "张叶云",
        "room": "9#501"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "会计学原理实训",
        "teacher": "韩春燕",
        "room": "4B412"
      },
      {
        "day": "周四",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "会计学原理实训",
        "teacher": "韩春燕",
        "room": "4B412"
      },
      {
        "day": "周四",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "张叶云",
        "room": "4C413"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "任立民",
        "room": "4A501"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "商务基础与专业导论A",
        "teacher": "林琳",
        "room": "4A405"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "会计学原理A",
        "teacher": "吴思",
        "room": "4B411"
      },
      {
        "day": "周四",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "会计学原理实训",
        "teacher": "韩春燕",
        "room": "4B412"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "人工智能导论",
        "teacher": "陈慧",
        "room": "4C314"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "俞雅莲",
        "room": "4B407"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "郑美香",
        "room": "4A501"
      },
      {
        "day": "周四",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "俞雅莲",
        "room": "4B407"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "吴冰",
        "room": "4C104"
      }
    ]
  },
  "25会计学（闽台合作4+0）【本科】1班": {
    "major": "会计学（闽台合作4+0）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "张佩兰",
        "room": "5A101"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "贾玉红",
        "room": "4A505"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "张佩兰",
        "room": "5C414"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "会计学原理实训",
        "teacher": "郭岚",
        "room": "4B207"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "人工智能导论",
        "teacher": "李锴",
        "room": "4C314"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "德法社会实践",
        "teacher": "张佩兰",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "商务基础与专业导论A",
        "teacher": "林琳",
        "room": "4A403"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "艺术基础素养",
        "teacher": "翁朝霞",
        "room": "4A406"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "颜峰坡",
        "room": "4A406"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "贾玉红",
        "room": "6B611-语音实验室(7)"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "11#320"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "颜峰坡",
        "room": "4A101"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "刘志勇",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "会计学原理A",
        "teacher": "周融",
        "room": "4B208"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "4C413"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "李衡荣",
        "room": "4A606"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "商务基础与专业导论A",
        "teacher": "林琳",
        "room": "4B410"
      },
      {
        "day": "周四",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学生职业生涯规划",
        "teacher": "杨颖",
        "room": "4A506"
      },
      {
        "day": "周四",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "高等数学D",
        "teacher": "颜峰坡",
        "room": "4A506"
      },
      {
        "day": "周四",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "会计学原理实训",
        "teacher": "郭岚",
        "room": "4A402"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "李衡荣",
        "room": "4A606"
      },
      {
        "day": "周四",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "黄礼锵",
        "room": "4A606"
      }
    ]
  },
  "25供应链管理【本科】1班": {
    "major": "供应链管理【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "张洁玲",
        "room": "7号楼C405"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "林方榕",
        "room": "7号楼B105"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "陈秀琴",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "高丹",
        "room": "7号楼B407"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "万菊",
        "room": "7号楼C405"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "供应链管理专业导论",
        "teacher": "陈宾",
        "room": "5B509"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "郭超",
        "room": "5B407"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "林方榕",
        "room": "7号楼B105"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "陈蔷",
        "room": "7号楼C201"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "万菊",
        "room": "7号楼C405"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "万菊",
        "room": "9#501"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "高丹",
        "room": "7号楼C203"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "陈蔷",
        "room": "7号楼C307"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "庄俊雄",
        "room": "7号楼C307"
      },
      {
        "day": "周四",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "庄俊雄",
        "room": "7号楼C307"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "林方榕",
        "room": "7号楼B105"
      },
      {
        "day": "周五",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "陈玲",
        "room": "7号楼C405"
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "陈玲",
        "room": "7号楼C405"
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "高等数学D",
        "teacher": "高丹",
        "room": "7号楼C203"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "郭超",
        "room": "4A506"
      },
      {
        "day": "周六",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "万菊",
        "room": "校外地点31"
      },
      {
        "day": "周六",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "陈秀琴",
        "room": "田径运动场"
      }
    ]
  },
  "25供应链管理【本科】2班": {
    "major": "供应链管理【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "供应链管理专业导论",
        "teacher": "陈宾",
        "room": "7号楼C304"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "高丹",
        "room": "7号楼B407"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "翁辉琳",
        "room": "7号楼C303"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "高丹",
        "room": "7号楼C203"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生职业生涯规划",
        "teacher": "陈蔷",
        "room": "7号楼C307"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "万菊",
        "room": "7号楼C405"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "陈蔷",
        "room": "7号楼C201"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "薛嵩剑",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "供应链管理专业导论",
        "teacher": "陈宾",
        "room": "7号楼C203"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "德法社会实践",
        "teacher": "万菊",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "万菊",
        "room": "7号楼C405"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "庄俊雄",
        "room": "7号楼C307"
      },
      {
        "day": "周二",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "庄俊雄",
        "room": "7号楼C307"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "郭超",
        "room": "5B407"
      },
      {
        "day": "周五",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "陈玲",
        "room": "7号楼C405"
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "陈玲",
        "room": "7号楼C405"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "高丹",
        "room": "7号楼C203"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "万菊",
        "room": "校外地点22"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "郭超",
        "room": "4A506"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学英语（1）",
        "teacher": "翁辉琳",
        "room": "7号楼C303"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "薛嵩剑",
        "room": "田径运动场"
      }
    ]
  },
  "25供应链管理（闽台合作4+0）【本科】1班": {
    "major": "供应链管理（闽台合作4+0）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "管理学原理B",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "应用写作与表达（艺管类）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "应用写作与表达（艺管类）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:00-16:20",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      }
    ]
  },
  "25保险学【本科】1班": {
    "major": "保险学【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "姜金花",
        "room": "5A406"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学体育（1）",
        "teacher": "周永亮",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "姜金花",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "罗冰清",
        "room": "5B210"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "洪琛",
        "room": "实训基地1（校外地点）"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "姜金花",
        "room": "5A406"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "微观经济学B",
        "teacher": "吴雪萍",
        "room": "5A406"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "谢玉枚",
        "room": "5C103"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "何洪娟",
        "room": "5C103"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学生职业生涯规划",
        "teacher": "揭红兰",
        "room": "5C103"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "何洪娟",
        "room": "5C104"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "微观经济学B",
        "teacher": "吴雪萍",
        "room": "5C103"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "陈庆华",
        "room": "5A101"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学C",
        "teacher": "罗冰清",
        "room": "5B210"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "邱全俊",
        "room": "5A306-量化星工场实践教学基地"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "翁朝霞",
        "room": "5A506"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "许燕",
        "room": "5A502"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "林赛花",
        "room": "5A406"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "林赛花",
        "room": "5A406"
      }
    ]
  },
  "25保险学【本科】2班": {
    "major": "保险学【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "姜金花",
        "room": "5A406"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "罗冰清",
        "room": "5B210"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "袁晗",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "洪琛",
        "room": "实训基地1（校外地点）"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "姜金花",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "何洪娟",
        "room": "5C104"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "邱全俊",
        "room": "5A306-量化星工场实践教学基地"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "陈庆华",
        "room": "5A101"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "翁朝霞",
        "room": "5A506"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "思想道德与法治",
        "teacher": "姜金花",
        "room": "5A406"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "微观经济学B",
        "teacher": "吴雪萍",
        "room": "5A406"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "谢玉枚",
        "room": "5C103"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "何洪娟",
        "room": "5C103"
      },
      {
        "day": "周三",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学生职业生涯规划",
        "teacher": "揭红兰",
        "room": "5C103"
      },
      {
        "day": "周三",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "王艳蕾",
        "room": "5C413"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "洪琛",
        "room": "5A502"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "何洪娟",
        "room": "5C103"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "微观经济学B",
        "teacher": "吴雪萍",
        "room": "5C103"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "形势与政策（1）",
        "teacher": "林赛花",
        "room": "5A406"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "许燕",
        "room": "5A502"
      },
      {
        "day": "周三",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "林赛花",
        "room": "5A406"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "高等数学C",
        "teacher": "罗冰清",
        "room": "5B210"
      }
    ]
  },
  "25信息管理与信息系统【本科】1班": {
    "major": "信息管理与信息系统【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学A（上）",
        "teacher": "罗培辉",
        "room": "12#317"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "徐琳",
        "room": "12#316"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "李桃",
        "room": "11#413"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "11#320"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "徐琳",
        "room": "6B611-语音实验室(7)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "李桃",
        "room": "11#413"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "郑思佳",
        "room": "11#515"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "程序设计基础",
        "teacher": "郑薇玮",
        "room": "6B309-计算机基础实验室(5)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "林建珠",
        "room": "11#215"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "管理学原理B",
        "teacher": "朱楠",
        "room": "12#320"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "郭平华",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "近现代史社会实践",
        "teacher": "李桃",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "徐琳",
        "room": "12#316"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "郑思佳",
        "room": "11#515"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "李桃",
        "room": "11#413"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "管理学原理B",
        "teacher": "朱楠",
        "room": "7号楼C302"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "程序设计基础",
        "teacher": "郑薇玮",
        "room": "6B209-计算机基础实验室(8)"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "彭东玲",
        "room": "11#209"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "彭东玲",
        "room": "11#209"
      }
    ]
  },
  "25信息管理与信息系统（闽台合作4+0）【本科】1班": {
    "major": "信息管理与信息系统（闽台合作4+0）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "程序设计基础",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "管理学原理B",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "程序设计基础",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "管理学原理B",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "5-6节",
        "time": "14:00-15:40",
        "name": "管理学原理B",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "高等数学A（上）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "1-6节",
        "time": "",
        "name": "管理学原理B",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "1-6节",
        "time": "",
        "name": "管理学原理B",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "7-10节",
        "time": "14:00-17:20",
        "name": "高等数学A（上）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周日",
        "period": "1-6节",
        "time": "",
        "name": "管理学原理B",
        "teacher": "",
        "room": ""
      }
    ]
  },
  "25光电信息科学与工程【本科】1班": {
    "major": "光电信息科学与工程【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "徐琳",
        "room": "6B611-语音实验室(7)"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学A（上）",
        "teacher": "江琳沁",
        "room": "12#214"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "徐琳",
        "room": "12#316"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学A（上）",
        "teacher": "江琳沁",
        "room": "12#214"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "智能光电子导论",
        "teacher": "邱羽",
        "room": "10#309"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "李晓",
        "room": "11#210"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "杨焕江",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "郑思佳",
        "room": "11#515"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "程序设计基础",
        "teacher": "吴小菁",
        "room": "6A306-计算机基础实验室(4)"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "李晓",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "王冰玉",
        "room": "12#418"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "王冰玉",
        "room": "12#418"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学A（上）",
        "teacher": "江琳沁",
        "room": "12#214"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "方慧兰",
        "room": "11#214"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "李晓",
        "room": "11#210"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "程序设计基础",
        "teacher": "吴小菁",
        "room": "6A306-计算机基础实验室(4)"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "李锴",
        "room": "12#518"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "徐琳",
        "room": "12#316"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "张如",
        "room": "11#215"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "方慧兰",
        "room": "11#214"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "张如",
        "room": "11#215"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "杨焕江",
        "room": "风雨球馆"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "近现代史社会实践",
        "teacher": "李晓",
        "room": "校外地点25"
      }
    ]
  },
  "25光电信息科学与工程【本科】2班": {
    "major": "光电信息科学与工程【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "程序设计基础",
        "teacher": "吴小菁",
        "room": "11#207工程管理虚拟仿真实验室"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "智能光电子导论",
        "teacher": "邱羽",
        "room": "10#309"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学A（上）",
        "teacher": "江琳沁",
        "room": "12#214"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "王冰玉",
        "room": "12#418"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "王冰玉",
        "room": "12#418"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "林明",
        "room": "12#214"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学A（上）",
        "teacher": "江琳沁",
        "room": "12#214"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "李晓",
        "room": "11#210"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "方慧兰",
        "room": "11#214"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "近现代史社会实践",
        "teacher": "李晓",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "张翠莲",
        "room": "11#209"
      },
      {
        "day": "周一",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "张翠莲",
        "room": "11#209"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "郑思佳",
        "room": "11#515"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "智能光电子导论",
        "teacher": "邱羽",
        "room": "12#213"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "李晓",
        "room": "11#210"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "李晓",
        "room": "校外地点15"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "林明",
        "room": "12#214"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "林明",
        "room": "11#518"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "人工智能导论",
        "teacher": "李锴",
        "room": "12#518"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "方慧兰",
        "room": "11#214"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学英语（1）",
        "teacher": "林明",
        "room": "12#415"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "柯亮",
        "room": "田径运动场"
      }
    ]
  },
  "25公共事业管理【本科】1班": {
    "major": "公共事业管理【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "吴宇宁",
        "room": "7号楼A502"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "政治学原理",
        "teacher": "张国栋",
        "room": "7号楼A203"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "程慧",
        "room": "6A604-语音实验室(3)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "薛嵩剑",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "吴宇宁",
        "room": "7号楼A204"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "公共伦理（双语）",
        "teacher": "陈乙酉",
        "room": "7号楼A303"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "许祥雁",
        "room": "4C104"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学语文",
        "teacher": "周艳菊",
        "room": "7号楼A204"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "陈星娥",
        "room": "5C104"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "政治学原理",
        "teacher": "张国栋",
        "room": "7号楼A204"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "程慧",
        "room": "7号楼A201"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "程慧",
        "room": "7号楼A206"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "公共伦理（双语）",
        "teacher": "陈乙酉",
        "room": "7号楼A303"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "许祥雁",
        "room": "4C104"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "邵丹妮",
        "room": "7号楼C306"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "唐琳",
        "room": "7号楼A303"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "近现代史社会实践",
        "teacher": "许祥雁",
        "room": "9#501"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "唐琳",
        "room": "7号楼A303"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "近现代史社会实践",
        "teacher": "许祥雁",
        "room": "校外地点18"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "江逸涵",
        "room": "5C103"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "江逸涵",
        "room": "5C103"
      },
      {
        "day": "周日",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "吴宇宁",
        "room": "7号楼A204"
      },
      {
        "day": "周日",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "薛嵩剑",
        "room": "田径运动场"
      }
    ]
  },
  "25公共事业管理（专升本）1班": {
    "major": "公共事业管理（专升本）",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "公共部门人力资源管理",
        "teacher": "陈济海",
        "room": "7号楼A204"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "管理学原理",
        "teacher": "郑建辉",
        "room": "7号楼A303"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "公共部门人力资源管理实训",
        "teacher": "陈济海",
        "room": "校外地点32"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "管理学原理实训",
        "teacher": "郑建辉",
        "room": "7号楼A303"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "社会学原理",
        "teacher": "伍柔静",
        "room": "7号楼A401"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "组织行为学",
        "teacher": "林美萍",
        "room": "7号楼A302"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "公共部门人力资源管理实训",
        "teacher": "陈济海",
        "room": "7号楼A402"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "公共伦理（双语）",
        "teacher": "陈乙酉",
        "room": "7号楼A501"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "管理学原理实训",
        "teacher": "郑建辉",
        "room": "校外地点34"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "谢明芳",
        "room": "4B507"
      },
      {
        "day": "周一",
        "period": "5-6节",
        "time": "14:00-15:40",
        "name": "管理学原理实训",
        "teacher": "郑建辉",
        "room": "校外地点34"
      },
      {
        "day": "周一",
        "period": "5-6节",
        "time": "14:00-15:40",
        "name": "公共部门人力资源管理实训",
        "teacher": "陈济海",
        "room": "校外地点32"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "公共部门人力资源管理实训",
        "teacher": "陈济海",
        "room": "7号楼A303"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "管理学原理实训",
        "teacher": "郑建辉",
        "room": "7号楼A303"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "许祥雁",
        "room": "4C104"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "管理学原理实训",
        "teacher": "郑建辉",
        "room": "校外地点31"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "夏博雯",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "管理学原理",
        "teacher": "郑建辉",
        "room": "7号楼A204"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "公共部门人力资源管理实训",
        "teacher": "陈济海",
        "room": "校外地点31"
      },
      {
        "day": "周三",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "公共部门人力资源管理实训",
        "teacher": "陈济海",
        "room": "7号楼A302"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "组织行为学",
        "teacher": "林美萍",
        "room": "5B410"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "许祥雁",
        "room": "4C104"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学D",
        "teacher": "谢明芳",
        "room": "4A406"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "公共部门人力资源管理",
        "teacher": "陈济海",
        "room": "7号楼A401"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "社会学原理",
        "teacher": "伍柔静",
        "room": "7号楼A204"
      }
    ]
  },
  "25公共事业管理（专升本）2班": {
    "major": "公共事业管理（专升本）",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "组织行为学",
        "teacher": "林美萍",
        "room": "7号楼A302"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "俞雅莲",
        "room": "7号楼A203"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "公共部门人力资源管理实训",
        "teacher": "林丽梅",
        "room": "校外地点34"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "公共部门人力资源管理",
        "teacher": "林丽梅",
        "room": "7号楼A402"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "社会学原理",
        "teacher": "伍柔静",
        "room": "7号楼A503"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "管理学原理实训",
        "teacher": "郑建辉",
        "room": "7号楼A303"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "管理学原理",
        "teacher": "郑建辉",
        "room": "7号楼A301"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "公共伦理（双语）",
        "teacher": "陈乙酉",
        "room": "7号楼A301"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "谢明芳",
        "room": "4B507"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "公共部门人力资源管理实训",
        "teacher": "林丽梅",
        "room": "7号楼A402"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "近现代史社会实践",
        "teacher": "俞雅莲",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "公共部门人力资源管理实训",
        "teacher": "林丽梅",
        "room": "校外地点34"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "公共部门人力资源管理",
        "teacher": "林丽梅",
        "room": "7号楼A401"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "组织行为学",
        "teacher": "林美萍",
        "room": "5B410"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "管理学原理实训",
        "teacher": "郑建辉",
        "room": "校外地点33"
      },
      {
        "day": "周三",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "管理学原理实训",
        "teacher": "郑建辉",
        "room": "7号楼A204"
      },
      {
        "day": "周三",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "管理学原理",
        "teacher": "郑建辉",
        "room": "7号楼A303"
      },
      {
        "day": "周三",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "公共部门人力资源管理实训",
        "teacher": "林丽梅",
        "room": "7号楼A402"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "公共部门人力资源管理",
        "teacher": "林丽梅",
        "room": "7号楼A303"
      },
      {
        "day": "周三",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "管理学原理实训",
        "teacher": "郑建辉",
        "room": "校外地点34"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "公共部门人力资源管理",
        "teacher": "林丽梅",
        "room": "7号楼A401"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学D",
        "teacher": "谢明芳",
        "room": "4A406"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "邹小江",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "公共部门人力资源管理实训",
        "teacher": "林丽梅",
        "room": "校外地点32"
      },
      {
        "day": "周五",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "俞雅莲",
        "room": "7号楼A201"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "公共伦理（双语）",
        "teacher": "陈乙酉",
        "room": "7号楼A301"
      }
    ]
  },
  "25动画【本科】1班": {
    "major": "动画【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "邢莉君",
        "room": "10#412"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "林娟",
        "room": "11#517"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "动画概论",
        "teacher": "王玉秋",
        "room": "10#504"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "动画造型基础1（人体结构）",
        "teacher": "龚应军",
        "room": "10#301（画室）"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "动画色彩基础1（色彩原理）",
        "teacher": "龚应军",
        "room": "10#301（画室）"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "数字动画基础",
        "teacher": "田保峰",
        "room": "11#106动漫游戏与虚拟仿真工程研究中心1"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "揭红兰",
        "room": "4C314"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林炜",
        "room": "5C103"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "中国近现代史纲要",
        "teacher": "梁云",
        "room": "11#513"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "动画造型基础1（人体结构）",
        "teacher": "龚应军",
        "room": "10#301（画室）"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林炜",
        "room": "5C103"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "梁云",
        "room": "11#513"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "动画造型基础1（人体结构）",
        "teacher": "龚应军",
        "room": "10#301（画室）"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "动画色彩基础1（色彩原理）",
        "teacher": "龚应军",
        "room": "10#301（画室）"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "数字动画基础",
        "teacher": "田保峰",
        "room": "11#106动漫游戏与虚拟仿真工程研究中心1"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "刘志勇",
        "room": "田径运动场"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "谢玉枚",
        "room": "11#320"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "梁云",
        "room": "9#501"
      },
      {
        "day": "周四",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "数字动画基础",
        "teacher": "田保峰",
        "room": "11#106动漫游戏与虚拟仿真工程研究中心1"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "动画概论",
        "teacher": "王玉秋",
        "room": "10#502"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "人工智能导论",
        "teacher": "张利红",
        "room": "11#320"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "梁云",
        "room": "11#513"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "林娟",
        "room": "10#411"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "朱佳彬",
        "room": "5C414"
      }
    ]
  },
  "25动画【本科】2班": {
    "major": "动画【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "邢莉君",
        "room": "10#412"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "数字动画基础",
        "teacher": "王玉秋",
        "room": "11#106动漫游戏与虚拟仿真工程研究中心1"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "动画色彩基础1（色彩原理）",
        "teacher": "龚正",
        "room": "10#302（画室）"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林炜",
        "room": "5C103"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "中国近现代史纲要",
        "teacher": "梁云",
        "room": "11#513"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "动画造型基础1（人体结构）",
        "teacher": "龚正",
        "room": "10#302（画室）"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林炜",
        "room": "5C103"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "林娟",
        "room": "11#517"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "动画概论",
        "teacher": "王玉秋",
        "room": "10#504"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "揭红兰",
        "room": "4C314"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "梁云",
        "room": "11#513"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "动画造型基础1（人体结构）",
        "teacher": "龚正",
        "room": "10#302（画室）"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "数字动画基础",
        "teacher": "王玉秋",
        "room": "11#106动漫游戏与虚拟仿真工程研究中心1"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "动画色彩基础1（色彩原理）",
        "teacher": "龚正",
        "room": "10#302（画室）"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "万玲莉",
        "room": "10#411"
      },
      {
        "day": "周一",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "万玲莉",
        "room": "10#411"
      },
      {
        "day": "周一",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "动画造型基础1（人体结构）",
        "teacher": "龚正",
        "room": "10#302（画室）"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "邹小江",
        "room": "田径运动场"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "梁云",
        "room": "9#501"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "谢玉枚",
        "room": "11#320"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "梁云",
        "room": "11#513"
      },
      {
        "day": "周四",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "动画色彩基础1（色彩原理）",
        "teacher": "龚正",
        "room": "10#302（画室）"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "林娟",
        "room": "10#411"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "动画概论",
        "teacher": "王玉秋",
        "room": "10#502"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "人工智能导论",
        "teacher": "张利红",
        "room": "11#320"
      }
    ]
  },
  "25动画（中外合作办学）【本科】1班": {
    "major": "动画（中外合作办学）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "雅思写作（1）",
        "teacher": "吴可佳",
        "room": "12#317"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "雅思听力（1）",
        "teacher": "郑竹群",
        "room": "10#405"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "雅思阅读（1）",
        "teacher": "陈励",
        "room": "4A204"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "姜金花",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "雅思口语（1）",
        "teacher": "苏丹",
        "room": "4A203"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学生职业生涯规划",
        "teacher": "陈雅茹",
        "room": "5A506"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "艺术基础素养",
        "teacher": "黄玲",
        "room": "4A506"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "雅思阅读（1）",
        "teacher": "陈励",
        "room": "12#210"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "雅思口语（1）",
        "teacher": "苏丹",
        "room": "10#410（梯形桌）"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "姜金花",
        "room": "5A506"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "世界动画史",
        "teacher": "王玉秋",
        "room": "11#209"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "雅思听力（1）",
        "teacher": "郑竹群",
        "room": "10#411"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "王玉波",
        "room": "11#413"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "雅思听力（1）",
        "teacher": "郑竹群",
        "room": "10#405"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "雅思口语（1）",
        "teacher": "苏丹",
        "room": "12#209"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "颜树铭",
        "room": "5A101"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "大学生职业生涯规划",
        "teacher": "陈雅茹",
        "room": "5A506"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "吴敏",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "雅思写作（1）",
        "teacher": "吴可佳",
        "room": "12#315"
      },
      {
        "day": "周三",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "动画基础",
        "teacher": "欧阳陆异",
        "room": "12#105动画创作综合实验室1"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "雅思阅读（1）",
        "teacher": "陈励",
        "room": "7号楼B107"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "颜树铭",
        "room": "7号楼C406"
      }
    ]
  },
  "25动画（中外合作办学）【本科】2班": {
    "major": "动画（中外合作办学）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "雅思阅读（1）",
        "teacher": "陈励",
        "room": "12#210"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "艺术基础素养",
        "teacher": "黄玲",
        "room": "4A506"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "动画基础",
        "teacher": "欧阳陆异",
        "room": "12#105动画创作综合实验室1"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学生职业生涯规划",
        "teacher": "陈雅茹",
        "room": "5A506"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "雅思口语（1）",
        "teacher": "苏丹",
        "room": "4A203"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "雅思口语（1）",
        "teacher": "苏丹",
        "room": "12#211"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "姜金花",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "雅思写作（1）",
        "teacher": "吴可佳",
        "room": "10#407（梯形桌）"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "姜金花",
        "room": "5A506"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "世界动画史",
        "teacher": "王玉秋",
        "room": "11#209"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "王玉波",
        "room": "11#413"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "雅思口语（1）",
        "teacher": "苏丹",
        "room": "10#410（梯形桌）"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "雅思听力（1）",
        "teacher": "叶逢源",
        "room": "6A605-语音实验室(4)"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "薛嵩剑",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "雅思听力（1）",
        "teacher": "叶逢源",
        "room": "6A605-语音实验室(4)"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "雅思阅读（1）",
        "teacher": "陈励",
        "room": "12#517"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "颜树铭",
        "room": "7号楼C406"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生职业生涯规划",
        "teacher": "陈雅茹",
        "room": "5A506"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "颜树铭",
        "room": "5A101"
      },
      {
        "day": "周四",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "动画基础",
        "teacher": "欧阳陆异",
        "room": "12#105动画创作综合实验室1"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "雅思写作（1）",
        "teacher": "吴可佳",
        "room": "12#315"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "姜金花",
        "room": "5A506"
      }
    ]
  },
  "25商务英语【本科】1班": {
    "major": "商务英语【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "商务英语阅读与写作（1）",
        "teacher": "姜蕴",
        "room": "10#104"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "英语语法（1）",
        "teacher": "江琳",
        "room": "10#102"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "商务英语视听说（1）",
        "teacher": "郑竹群",
        "room": "10#108"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "吴妍",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "吴妍",
        "room": "11#209"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "商务英语视听说（1）",
        "teacher": "郑璐杰",
        "room": "11#111数字融媒体采编实验室"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "英语国家社会与文化",
        "teacher": "吴晓晖",
        "room": "10#101"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "张利红",
        "room": "11#215"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "综合商务英语（1）",
        "teacher": "池舒文",
        "room": "10#101"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "郑真",
        "room": "5C104"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "郑真",
        "room": "5C104"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "高晓",
        "room": "11#215"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "综合商务英语（1）",
        "teacher": "池舒文",
        "room": "10#102"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学语文",
        "teacher": "陈玲",
        "room": "10#108"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "陈碧娇",
        "room": "11#512"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "黄露",
        "room": "4C104"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "商务英语视听说（1）",
        "teacher": "郑竹群",
        "room": "10#108"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "英语国家社会与文化",
        "teacher": "吴晓晖",
        "room": "10#101"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国文化概论（英）",
        "teacher": "苏丹",
        "room": "10#101"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "综合商务英语（1）",
        "teacher": "池舒文",
        "room": "10#101"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "吴妍",
        "room": "11#209"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "英语语法（1）",
        "teacher": "江琳",
        "room": "10#101"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "商务英语阅读与写作（1）",
        "teacher": "姜蕴",
        "room": "10#102"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "林宏浩",
        "room": "4C413"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "王波",
        "room": "田径运动场"
      }
    ]
  },
  "25商务英语【本科】2班": {
    "major": "商务英语【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "综合商务英语（1）",
        "teacher": "池舒文",
        "room": "10#101"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "吴妍",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "英语国家社会与文化",
        "teacher": "吴晓晖",
        "room": "10#103"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "商务英语阅读与写作（1）",
        "teacher": "姜蕴",
        "room": "10#104"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "吴妍",
        "room": "11#209"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "商务英语视听说（1）",
        "teacher": "林婧",
        "room": "6B609-语音实验室(5)"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "综合商务英语（1）",
        "teacher": "池舒文",
        "room": "10#102"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "张利红",
        "room": "11#215"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "英语语法（1）",
        "teacher": "江琳",
        "room": "10#102"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "郑真",
        "room": "5C104"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "郑真",
        "room": "5C104"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "艺术基础素养",
        "teacher": "陈碧娇",
        "room": "11#512"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "高晓",
        "room": "11#215"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国文化概论（英）",
        "teacher": "苏丹",
        "room": "10#101"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "英语语法（1）",
        "teacher": "江琳",
        "room": "10#102"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "综合商务英语（1）",
        "teacher": "池舒文",
        "room": "10#101"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "商务英语阅读与写作（1）",
        "teacher": "姜蕴",
        "room": "10#103"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "商务英语视听说（1）",
        "teacher": "林婧",
        "room": "11#111数字融媒体采编实验室"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "黄露",
        "room": "4C104"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "郭平华",
        "room": "田径运动场"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "英语国家社会与文化",
        "teacher": "吴晓晖",
        "room": "10#102"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "吴妍",
        "room": "11#209"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "英语语法（1）",
        "teacher": "江琳",
        "room": "10#108"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学语文",
        "teacher": "陈玲",
        "room": "10#108"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "商务英语视听说（1）",
        "teacher": "林婧",
        "room": "6B609-语音实验室(5)"
      }
    ]
  },
  "25商务英语【本科】3班": {
    "major": "商务英语【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国文化概论（英）",
        "teacher": "苏丹",
        "room": "10#102"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "商务英语视听说（1）",
        "teacher": "林婧",
        "room": "11#111数字融媒体采编实验室"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "综合商务英语（1）",
        "teacher": "池舒文",
        "room": "10#102"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "商务英语视听说（1）",
        "teacher": "林婧",
        "room": "6B609-语音实验室(5)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "商务英语阅读与写作（1）",
        "teacher": "姜蕴",
        "room": "10#102"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "吴妍",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "张利红",
        "room": "11#215"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "综合商务英语（1）",
        "teacher": "池舒文",
        "room": "10#102"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "高晓",
        "room": "11#215"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学语文",
        "teacher": "陈玲",
        "room": "10#102"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "陈碧娇",
        "room": "11#512"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "黄露",
        "room": "4C104"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "思想道德与法治",
        "teacher": "吴妍",
        "room": "11#209"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "商务英语视听说（1）",
        "teacher": "林婧",
        "room": "6B609-语音实验室(5)"
      },
      {
        "day": "周三",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "郑真",
        "room": "5C104"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "郑真",
        "room": "5C104"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "英语语法（1）",
        "teacher": "江琳",
        "room": "10#102"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "邹小江",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "英语国家社会与文化",
        "teacher": "吴晓晖",
        "room": "10#102"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "英语语法（1）",
        "teacher": "江琳",
        "room": "10#102"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "英语语法（1）",
        "teacher": "江琳",
        "room": "10#105"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "综合商务英语（1）",
        "teacher": "池舒文",
        "room": "10#102"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "英语国家社会与文化",
        "teacher": "吴晓晖",
        "room": "10#102"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "沈洲",
        "room": "4B407"
      },
      {
        "day": "周四",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "沈洲",
        "room": "4B407"
      },
      {
        "day": "周四",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "思想道德与法治",
        "teacher": "吴妍",
        "room": "11#209"
      }
    ]
  },
  "25国际商务【本科】1班": {
    "major": "国际商务【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "林智华",
        "room": "9#103"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "吴小菁",
        "room": "11#215"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "车志红",
        "room": "9#101"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "林智华",
        "room": "12#213"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "胡小梅",
        "room": "9#201"
      },
      {
        "day": "周一",
        "period": "9-9节",
        "time": "",
        "name": "高等数学C",
        "teacher": "林智华",
        "room": "12#317"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "车志红",
        "room": "6B610-语音实验室(6)"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "许金富",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "胡小梅",
        "room": "9#201"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "思想道德与法治",
        "teacher": "张翠莲",
        "room": "11#412"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "电子商务概论B",
        "teacher": "李敏杰",
        "room": "9#102"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "高等数学C",
        "teacher": "林智华",
        "room": "9#103"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "林智华",
        "room": "9#103"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "张翠莲",
        "room": "11#412"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "德法社会实践",
        "teacher": "张翠莲",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "汤宁鋆",
        "room": "11#514"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "电子商务概论B",
        "teacher": "李敏杰",
        "room": "9#102"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "车志红",
        "room": "9#104"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "林智华",
        "room": "12#214"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "汤宁鋆",
        "room": "11#514"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "陈碧娇",
        "room": "4B507"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "邓晓君",
        "room": "11#211"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "陈碧娇",
        "room": "11#412"
      }
    ]
  },
  "25国际经济与贸易【本科】1班": {
    "major": "国际经济与贸易【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "林喜季",
        "room": "4B512"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "黄皓萍",
        "room": "6B611-语音实验室(7)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "跨境电商导论B",
        "teacher": "宋磊",
        "room": "9#207经济综合实验室"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "陈晓静",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "王艳蕾",
        "room": "9#201"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "德法社会实践",
        "teacher": "陈超敏",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "卓琳",
        "room": "4C314"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "黄皓萍",
        "room": "9#101"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "陈超敏",
        "room": "11#209"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "汤宁鋆",
        "room": "11#514"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "陈超敏",
        "room": "11#209"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "林喜季",
        "room": "9#304"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "艺术基础素养",
        "teacher": "陈碧娇",
        "room": "4B507"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "汤宁鋆",
        "room": "11#514"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "吴妍",
        "room": "10#412"
      },
      {
        "day": "周四",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "吴妍",
        "room": "10#412"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "陈碧娇",
        "room": "11#412"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "陈超敏",
        "room": "校外地点32"
      },
      {
        "day": "周五",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "林凯",
        "room": "11#418"
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "林凯",
        "room": "11#418"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "应用写作与表达（财经类）",
        "teacher": "王艳蕾",
        "room": "9#201"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "汤宁鋆",
        "room": "10#412"
      },
      {
        "day": "周六",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "黄皓萍",
        "room": "11#412"
      },
      {
        "day": "周六",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "林喜季",
        "room": "9#304"
      }
    ]
  },
  "25国际经济与贸易（SQA-AD项目）【本科】1班": {
    "major": "国际经济与贸易（SQA-AD项目）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "7-9节",
        "time": "14:00-16:20",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "雅思口语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "雅思口语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "雅思阅读（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "9-13节",
        "time": "",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "雅思写作（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "雅思听力（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "雅思阅读（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "雅思口语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "劳动教育",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周日",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "",
        "room": ""
      }
    ]
  },
  "25国际经济与贸易（SQA-AD项目）【本科】2班": {
    "major": "国际经济与贸易（SQA-AD项目）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "7-9节",
        "time": "14:00-16:20",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "雅思口语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "9-13节",
        "time": "",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "雅思阅读（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "雅思听力（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学D",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "雅思写作（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "雅思听力（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周日",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "",
        "room": ""
      }
    ]
  },
  "25国际经济与贸易（闽台合作4+0）【本科】1班": {
    "major": "国际经济与贸易（闽台合作4+0）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:00-16:20",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "劳动教育",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周日",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "",
        "room": ""
      }
    ]
  },
  "25国际经济与贸易（闽台合作4+0）【本科】2班": {
    "major": "国际经济与贸易（闽台合作4+0）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:00-16:20",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "劳动教育",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周日",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "",
        "room": ""
      }
    ]
  },
  "25土木工程【本科】1班": {
    "major": "土木工程【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学R (上）",
        "teacher": "林晶",
        "room": "12#319"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "AI赋能的数据库基础",
        "teacher": "卓琳",
        "room": "6B309-计算机基础实验室(5)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "AI赋能的数据库基础",
        "teacher": "卓琳",
        "room": "6A306-计算机基础实验室(4)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "工程制图与识图",
        "teacher": "陈晶",
        "room": "11#417"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "梁云",
        "room": "11#514"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学化学",
        "teacher": "熊浩",
        "room": "12#315"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "韦艳赠",
        "room": "11#214"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "7号楼C307"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "7号楼C307"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "中国近现代史纲要",
        "teacher": "梁云",
        "room": "11#513"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学R (上）",
        "teacher": "林晶",
        "room": "12#319"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "高等数学R (上）",
        "teacher": "林晶",
        "room": "12#319"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "韦艳赠",
        "room": "11#214"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学R (上）",
        "teacher": "林晶",
        "room": "12#316"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "7号楼C307"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "工程制图与识图",
        "teacher": "陈晶",
        "room": "11#417"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "朱艳钦",
        "room": "11#211"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "形势与政策（1）",
        "teacher": "纪圣驹",
        "room": "11#211"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "近现代史社会实践",
        "teacher": "梁云",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "陈亨明",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "纪圣驹",
        "room": "11#211"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "朱艳钦",
        "room": "11#215"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "刘嘉敏",
        "room": "11#215"
      }
    ]
  },
  "25土木工程【本科】2班": {
    "major": "土木工程【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "梁云",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "AI赋能的数据库基础",
        "teacher": "卓琳",
        "room": "6B309-计算机基础实验室(5)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学R (上）",
        "teacher": "林晶",
        "room": "12#319"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "工程制图与识图",
        "teacher": "陈晶",
        "room": "11#417"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "梁云",
        "room": "11#514"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学R (上）",
        "teacher": "林晶",
        "room": "12#319"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "梁云",
        "room": "11#513"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "韦艳赠",
        "room": "11#214"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "7号楼C307"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "7号楼C307"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "高等数学R (上）",
        "teacher": "林晶",
        "room": "12#319"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "周永亮",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学化学",
        "teacher": "熊浩",
        "room": "12#315"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "韦艳赠",
        "room": "11#214"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "工程制图与识图",
        "teacher": "陈晶",
        "room": "11#214"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "7号楼C307"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学R (上）",
        "teacher": "林晶",
        "room": "12#516"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "朱艳钦",
        "room": "11#211"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "形势与政策（1）",
        "teacher": "纪圣驹",
        "room": "11#211"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "AI赋能的数据库基础",
        "teacher": "卓琳",
        "room": "6A306-计算机基础实验室(4)"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "土木工程概论",
        "teacher": "张飞",
        "room": "11#417"
      },
      {
        "day": "周三",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "纪圣驹",
        "room": "11#211"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "朱艳钦",
        "room": "11#215"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "刘嘉敏",
        "room": "11#215"
      }
    ]
  },
  "25土木工程（专升本）1班": {
    "major": "土木工程（专升本）",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "房屋建筑学",
        "teacher": "谭佳丽",
        "room": "11#315"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "土木工程制图与CAD",
        "teacher": "陈文超",
        "room": "11#313—装配式立体化教学实验室"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "土木工程材料",
        "teacher": "李致远",
        "room": "9#301"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "土木工程制图与CAD",
        "teacher": "陈文超",
        "room": "11#313—装配式立体化教学实验室"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "材料力学",
        "teacher": "吴正宇",
        "room": "11#517"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "工程地质",
        "teacher": "李致远",
        "room": "9#302"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "土木工程材料",
        "teacher": "李致远",
        "room": "9#302"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "房屋建筑学",
        "teacher": "谭佳丽",
        "room": "11#513"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "工程监理理论与实务",
        "teacher": "郑素苹",
        "room": "9#204"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "材料力学",
        "teacher": "吴正宇",
        "room": "11#416"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "夏博雯",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "俞雅莲",
        "room": "9#103"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "材料力学",
        "teacher": "吴正宇",
        "room": "11#417"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "工程伦理学",
        "teacher": "梁磊",
        "room": "11#414"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "建筑工业化概论",
        "teacher": "陈溢晨",
        "room": "11#314"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "土木工程制图与CAD",
        "teacher": "陈文超",
        "room": "9#102"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "俞雅莲",
        "room": "9#103"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "近现代史社会实践",
        "teacher": "俞雅莲",
        "room": "9#501"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "建筑工业化概论",
        "teacher": "崔广强",
        "room": "11#314"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "林榕馨",
        "room": "4A606"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "林榕馨",
        "room": "4A606"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "材料力学",
        "teacher": "吴正宇",
        "room": "11#515"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "近现代史社会实践",
        "teacher": "俞雅莲",
        "room": "校外地点22"
      }
    ]
  },
  "25工业工程【本科】1班": {
    "major": "工业工程【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "工程制图与识图",
        "teacher": "孟鑫鑫",
        "room": "12#210"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "陈琳琳",
        "room": "11#211"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学体育（1）",
        "teacher": "许芳",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "朱艳钦",
        "room": "11#215"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学A（上）",
        "teacher": "雷群",
        "room": "12#416"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "11#320"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学A（上）",
        "teacher": "雷群",
        "room": "12#416"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "近现代史社会实践",
        "teacher": "林赛花",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "陈琳琳",
        "room": "11#211"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "刘嘉敏",
        "room": "11#215"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "工程制图与识图",
        "teacher": "孟鑫鑫",
        "room": "11#417"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "黄菲菲",
        "room": "11#209"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "林赛花",
        "room": "11#211"
      },
      {
        "day": "周四",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "11#320"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "11#320"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "杨玮",
        "room": "12#518"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "林赛花",
        "room": "11#211"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "赵亮",
        "room": "11#513"
      },
      {
        "day": "周四",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "赵亮",
        "room": "11#513"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "朱艳钦",
        "room": "11#211"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "工业工程导论",
        "teacher": "杨艳华",
        "room": "11#319"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "工业工程导论",
        "teacher": "梁雪",
        "room": "11#319"
      }
    ]
  },
  "25工业工程【本科】2班": {
    "major": "工业工程【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "黄菲菲",
        "room": "11#516"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "工程制图与识图",
        "teacher": "孟鑫鑫",
        "room": "12#210"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "陈琳琳",
        "room": "11#211"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学A（上）",
        "teacher": "林响",
        "room": "12#413"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "陈琳琳",
        "room": "11#516"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "近现代史社会实践",
        "teacher": "林赛花",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "许芳",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "林赛花",
        "room": "11#211"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "工程制图与识图",
        "teacher": "孟鑫鑫",
        "room": "11#417"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "11#320"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "陈琳琳",
        "room": "11#211"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "刘嘉敏",
        "room": "11#215"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "朱艳钦",
        "room": "11#215"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "黄菲菲",
        "room": "11#209"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学A（上）",
        "teacher": "林响",
        "room": "12#413"
      },
      {
        "day": "周四",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "11#320"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "11#320"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "杨玮",
        "room": "12#518"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "工业工程导论",
        "teacher": "杨艳华",
        "room": "11#319"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "林赛花",
        "room": "11#211"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "工业工程导论",
        "teacher": "刘雪峰",
        "room": "11#319"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "赵亮",
        "room": "11#513"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "朱艳钦",
        "room": "11#211"
      }
    ]
  },
  "25工业工程（闽台合作4+0）【本科】1班": {
    "major": "工业工程（闽台合作4+0）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "李冬梅",
        "room": "6A602-语音实验室(1)"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "张佩兰",
        "room": "5C414"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "工程制图与识图",
        "teacher": "孟鑫鑫",
        "room": "12#213"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "11#320"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "德法社会实践",
        "teacher": "张佩兰",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学A（上）",
        "teacher": "罗培辉",
        "room": "12#317"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "李冬梅",
        "room": "4B208"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "徐俊辉",
        "room": "5C103"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "江武贵",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "曾燕清",
        "room": "11#518"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "李冬梅",
        "room": "11#210"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "4C413"
      },
      {
        "day": "周三",
        "period": "9-13节",
        "time": "",
        "name": "工业工程导论",
        "teacher": "林立伟",
        "room": "4B412"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生职业生涯规划",
        "teacher": "徐俊辉",
        "room": "11#418"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "张佩兰",
        "room": "5C414"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学A（上）",
        "teacher": "罗培辉",
        "room": "12#316"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "形势与政策（1）",
        "teacher": "黄瑞腾",
        "room": "11#211"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "工程制图与识图",
        "teacher": "孟鑫鑫",
        "room": "11#210"
      },
      {
        "day": "周四",
        "period": "7-13节",
        "time": "",
        "name": "工业工程导论",
        "teacher": "林立伟",
        "room": "4B207"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "徐俊辉",
        "room": "11#413"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "黄瑞腾",
        "room": "12#518"
      }
    ]
  },
  "25工业设计【本科】1班": {
    "major": "工业设计【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "郑淑霞",
        "room": "10#405"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "林小君",
        "room": "10#503"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "设计素描",
        "teacher": "彭星星",
        "room": "10#304（画室）"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "设计色彩",
        "teacher": "彭星星",
        "room": "10#304（画室）"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "设计概论",
        "teacher": "孔雪原",
        "room": "12#107虚拟仿真实验室"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "郑淑霞",
        "room": "10#405"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "林小君",
        "room": "10#503"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "关翔锋",
        "room": "11#320"
      },
      {
        "day": "周二",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "设计色彩",
        "teacher": "彭星星",
        "room": "10#304（画室）"
      },
      {
        "day": "周二",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "朱婧",
        "room": "11#515"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学生职业生涯规划",
        "teacher": "揭红兰",
        "room": "10#412"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "设计素描",
        "teacher": "彭星星",
        "room": "10#304（画室）"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "江逸涵",
        "room": "10#412"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "林小君",
        "room": "10#501"
      },
      {
        "day": "周二",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "设计色彩",
        "teacher": "彭星星",
        "room": "10#304（画室）"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "江逸涵",
        "room": "10#412"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学D",
        "teacher": "郑淑霞",
        "room": "10#405"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "朱婧",
        "room": "11#515"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "设计素描",
        "teacher": "彭星星",
        "room": "10#304（画室）"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "吴奕旸",
        "room": "11#214"
      },
      {
        "day": "周二",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "吴奕旸",
        "room": "11#214"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "陈秀琴",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "近现代史社会实践",
        "teacher": "江逸涵",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "江逸涵",
        "room": "10#412"
      }
    ]
  },
  "25工业设计【本科】2班": {
    "major": "工业设计【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "设计概论",
        "teacher": "孔雪原",
        "room": "12#107虚拟仿真实验室"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "设计色彩",
        "teacher": "彭星星",
        "room": "10#305（画室）"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "林小君",
        "room": "10#505"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "设计素描",
        "teacher": "郭于明",
        "room": "10#305（画室）"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "江逸涵",
        "room": "10#412"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学生职业生涯规划",
        "teacher": "揭红兰",
        "room": "10#412"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "人工智能导论",
        "teacher": "关翔锋",
        "room": "11#320"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "江逸涵",
        "room": "10#412"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "林小君",
        "room": "10#505"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "薛嵩剑",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "林小君",
        "room": "10#501"
      },
      {
        "day": "周三",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "设计色彩",
        "teacher": "彭星星",
        "room": "10#305（画室）"
      },
      {
        "day": "周三",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "朱婧",
        "room": "11#515"
      },
      {
        "day": "周三",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "设计素描",
        "teacher": "郭于明",
        "room": "10#305（画室）"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "郑淑霞",
        "room": "10#405"
      },
      {
        "day": "周三",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "大学生心理健康教育",
        "teacher": "朱婧",
        "room": "11#515"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "近现代史社会实践",
        "teacher": "江逸涵",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "朱婧",
        "room": "11#515"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "设计素描",
        "teacher": "郭于明",
        "room": "10#305（画室）"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "设计色彩",
        "teacher": "彭星星",
        "room": "10#305（画室）"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "陈伊凡",
        "room": "10#411"
      },
      {
        "day": "周三",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "陈伊凡",
        "room": "10#411"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "高等数学D",
        "teacher": "郑淑霞",
        "room": "10#405"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "江逸涵",
        "room": "10#412"
      }
    ]
  },
  "25工程造价【本科】1班": {
    "major": "工程造价【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "陈琳琳",
        "room": "6A605-语音实验室(4)"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "工程制图与识图",
        "teacher": "柴敏",
        "room": "11#319"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "廖一帆",
        "room": "11#210"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "7号楼C307"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "7号楼C307"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "江武贵",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学A（上）",
        "teacher": "雷群",
        "room": "12#416"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "近现代史社会实践",
        "teacher": "林赛花",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "陈琳琳",
        "room": "11#319"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "工程造价概论",
        "teacher": "张曦",
        "room": "11#211"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "郑美香",
        "room": "6A605-语音实验室(4)"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "刘日",
        "room": "11#513"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "林赛花",
        "room": "11#211"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "杨玮",
        "room": "12#518"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "廖一帆",
        "room": "4B407"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "工程造价概论",
        "teacher": "张曦",
        "room": "11#320"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "形势与政策（1）",
        "teacher": "陈秋云",
        "room": "11#518"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "郑美香",
        "room": "11#319"
      },
      {
        "day": "周四",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "陈秋云",
        "room": "11#518"
      },
      {
        "day": "周四",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "高等数学A（上）",
        "teacher": "雷群",
        "room": "12#416"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "林赛花",
        "room": "11#209"
      }
    ]
  },
  "25工程造价【本科】2班": {
    "major": "工程造价【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学A（上）",
        "teacher": "雷群",
        "room": "12#416"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "吴小菁",
        "room": "11#215"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "廖一帆",
        "room": "11#210"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "工程制图与识图",
        "teacher": "陈溢晨",
        "room": "11#412"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "7号楼C307"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "7号楼C307"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "陈琳琳",
        "room": "6A605-语音实验室(4)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "近现代史社会实践",
        "teacher": "林赛花",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "刘日",
        "room": "11#513"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "胡晓希",
        "room": "11#211"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "7号楼C307"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "大学英语（1）",
        "teacher": "陈琳琳",
        "room": "11#211"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "工程造价概论",
        "teacher": "张曦",
        "room": "11#211"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "林赛花",
        "room": "11#211"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "工程制图与识图",
        "teacher": "陈溢晨",
        "room": "11#210"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "胡晓希",
        "room": "11#320"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "廖一帆",
        "room": "4B407"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "谢飞",
        "room": "田径运动场"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "工程造价概论",
        "teacher": "张曦",
        "room": "11#320"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "陈秋云",
        "room": "11#518"
      },
      {
        "day": "周四",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "陈秋云",
        "room": "11#518"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "林赛花",
        "room": "11#209"
      }
    ]
  },
  "25市场营销【本科】1班": {
    "major": "市场营销【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "翁辉琳",
        "room": "7号楼C505"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "市场营销专业导论",
        "teacher": "林旭耀",
        "room": "7号楼C307"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "宋晓秋",
        "room": "7号楼C406"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "万菊",
        "room": "7号楼C405"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "赵春莹",
        "room": "7号楼C202"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "万菊",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "郭超",
        "room": "5B407"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "万菊",
        "room": "7号楼C406"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "陈蔷",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "王波",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学D",
        "teacher": "赵春莹",
        "room": "7号楼C202"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "林文羿",
        "room": "7号楼C208"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "陈蔷",
        "room": "7号楼C505"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学英语（1）",
        "teacher": "翁辉琳",
        "room": "5C103"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "翁辉琳",
        "room": "7号楼C405"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学体育（1）",
        "teacher": "王波",
        "room": "田径运动场"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "赵春莹",
        "room": "7号楼C202"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "王波",
        "room": "田径运动场"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "德法社会实践",
        "teacher": "万菊",
        "room": "校外地点34"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "林文羿",
        "room": "7号楼C208"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "陈蔷",
        "room": "7号楼C405"
      }
    ]
  },
  "25市场营销【本科】2班": {
    "major": "市场营销【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "翁辉琳",
        "room": "7号楼C505"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "市场营销专业导论",
        "teacher": "林旭耀",
        "room": "7号楼C307"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "万菊",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "万菊",
        "room": "7号楼C405"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "万菊",
        "room": "7号楼C306"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "翁辉琳",
        "room": "7号楼C405"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "赵春莹",
        "room": "7号楼C202"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "万菊",
        "room": "7号楼C406"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "陈蔷",
        "room": "7号楼C201"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "郭超",
        "room": "5B407"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "陈蔷",
        "room": "7号楼C505"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学英语（1）",
        "teacher": "翁辉琳",
        "room": "5C103"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "谢玉枚",
        "room": "11#320"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "许金富",
        "room": "田径运动场"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "张利红",
        "room": "11#320"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "赵春莹",
        "room": "7号楼C202"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "翁辉琳",
        "room": "7号楼C405"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "赵春莹",
        "room": "7号楼C202"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "郭超",
        "room": "4A506"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "林文羿",
        "room": "7号楼C208"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "许金富",
        "room": "田径运动场"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "德法社会实践",
        "teacher": "万菊",
        "room": "校外地点23"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "林文羿",
        "room": "7号楼C208"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "陈蔷",
        "room": "7号楼C405"
      }
    ]
  },
  "25投资学【本科】1班": {
    "major": "投资学【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "刘文标",
        "room": "5A205"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "姜金花",
        "room": "5A406"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "何洪娟",
        "room": "6B610-语音实验室(6)"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "何洪娟",
        "room": "5B209"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "微观经济学B",
        "teacher": "吴雪萍",
        "room": "5B209"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "刘文标",
        "room": "5A205"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "姜金花",
        "room": "5A406"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "邱维平",
        "room": "5C104"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "邱维平",
        "room": "5C104"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "大学英语（1）",
        "teacher": "何洪娟",
        "room": "5B210"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "德法社会实践",
        "teacher": "姜金花",
        "room": "校外地点27"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "艺术基础素养",
        "teacher": "翁朝霞",
        "room": "5A201"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "微观经济学B",
        "teacher": "吴雪萍",
        "room": "5B409"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "形势与政策（1）",
        "teacher": "林卉",
        "room": "5C413"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "邹小江",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "德法社会实践",
        "teacher": "姜金花",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "人工智能导论",
        "teacher": "高晓",
        "room": "5C413"
      },
      {
        "day": "周二",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "林卉",
        "room": "5C413"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学语文",
        "teacher": "邱维平",
        "room": "5A402"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "揭红兰",
        "room": "5C103"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "高等数学C",
        "teacher": "刘文标",
        "room": "5A205"
      }
    ]
  },
  "25数字经济【本科】1班": {
    "major": "数字经济【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "政治经济学C",
        "teacher": "康迎春",
        "room": "11#516"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "黄皓萍",
        "room": "11#512"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "龚曲华",
        "room": "9#104"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "王凯",
        "room": "11#210"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "张翠莲",
        "room": "11#412"
      },
      {
        "day": "周一",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "王凯",
        "room": "11#210"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "龚曲华",
        "room": "9#104"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "应用写作与表达（财经类）",
        "teacher": "陈振文",
        "room": "9#302"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "陈晓静",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "陈碧娇",
        "room": "11#512"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "黄皓萍",
        "room": "11#512"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "政治经济学C",
        "teacher": "康迎春",
        "room": "11#512"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "黄皓萍",
        "room": "11#512"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "王志锴",
        "room": "11#512"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "龚曲华",
        "room": "9#104"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "杨玮",
        "room": "12#518"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "龚曲华",
        "room": "9#104"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "陈振文",
        "room": "9#302"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "思想道德与法治",
        "teacher": "张翠莲",
        "room": "11#413"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "黄皓萍",
        "room": "11#512"
      },
      {
        "day": "周五",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "胡小梅",
        "room": "11#412"
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "胡小梅",
        "room": "11#412"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "德法社会实践",
        "teacher": "张翠莲",
        "room": "9#501"
      },
      {
        "day": "周六",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "龚曲华",
        "room": "9#104"
      }
    ]
  },
  "25数字经济【本科】2班": {
    "major": "数字经济【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "政治经济学C",
        "teacher": "康迎春",
        "room": "11#516"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "龚曲华",
        "room": "9#104"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "黄皓萍",
        "room": "11#512"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "王凯",
        "room": "11#210"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "张翠莲",
        "room": "11#412"
      },
      {
        "day": "周一",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "王凯",
        "room": "11#210"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "应用写作与表达（财经类）",
        "teacher": "陈振文",
        "room": "9#302"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "龚曲华",
        "room": "9#104"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "政治经济学C",
        "teacher": "康迎春",
        "room": "11#512"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "陈碧娇",
        "room": "11#512"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "黄皓萍",
        "room": "11#512"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "龚曲华",
        "room": "9#104"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "杨玮",
        "room": "12#518"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "黄皓萍",
        "room": "11#512"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "王志锴",
        "room": "11#512"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "吴敏",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "德法社会实践",
        "teacher": "张翠莲",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "思想道德与法治",
        "teacher": "张翠莲",
        "room": "11#413"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "高等数学C",
        "teacher": "龚曲华",
        "room": "9#104"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "黄皓萍",
        "room": "11#512"
      },
      {
        "day": "周五",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "胡小梅",
        "room": "11#412"
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "胡小梅",
        "room": "11#412"
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "高等数学C",
        "teacher": "龚曲华",
        "room": "9#104"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "吴敏",
        "room": "田径运动场"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "陈振文",
        "room": "9#302"
      }
    ]
  },
  "25数据科学与大数据技术【本科】1班": {
    "major": "数据科学与大数据技术【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "林明",
        "room": "12#214"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学A（上）",
        "teacher": "郑敏",
        "room": "12#415"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "专业认知",
        "teacher": "杨乐华",
        "room": "12#312-ERP信息化实验室"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "Java程序设计基础",
        "teacher": "杨乐华",
        "room": "6A305-计算机基础实验室(3)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "李桃",
        "room": "11#413"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "江武贵",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "专业认知",
        "teacher": "杨乐华",
        "room": "12#312-ERP信息化实验室"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "郑思佳",
        "room": "11#515"
      },
      {
        "day": "周二",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "专业认知",
        "teacher": "杨乐华",
        "room": "12#312-ERP信息化实验室"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "11#320"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "11#320"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "高等数学A（上）",
        "teacher": "郑敏",
        "room": "12#515"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "Java程序设计基础",
        "teacher": "杨乐华",
        "room": "6A305-计算机基础实验室(3)"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "李桃",
        "room": "11#413"
      },
      {
        "day": "周二",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "专业认知",
        "teacher": "杨乐华",
        "room": "12#312-ERP信息化实验室"
      },
      {
        "day": "周二",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "大学生职业生涯规划",
        "teacher": "郑思佳",
        "room": "11#515"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "林建珠",
        "room": "11#215"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "林明",
        "room": "12#214"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "专业认知",
        "teacher": "杨乐华",
        "room": "12#312-ERP信息化实验室"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "李桃",
        "room": "11#413"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "Java程序设计基础",
        "teacher": "杨乐华",
        "room": "6A305-计算机基础实验室(3)"
      }
    ]
  },
  "25文化产业管理【本科】1班": {
    "major": "文化产业管理【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "林小君",
        "room": "10#505"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "中国近现代史纲要",
        "teacher": "江逸涵",
        "room": "10#411"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "江逸涵",
        "room": "10#412"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "林小君",
        "room": "10#505"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "江逸涵",
        "room": "10#412"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "文化产业管理概论",
        "teacher": "林汉铮",
        "room": "10#502"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生职业生涯规划",
        "teacher": "林涛",
        "room": "11#515"
      },
      {
        "day": "周二",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "文化产业管理专业导论",
        "teacher": "袁涛",
        "room": "10#504"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学体育（1）",
        "teacher": "周永亮",
        "room": "啦啦操馆（2）"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "关翔锋",
        "room": "11#320"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "社区服务法律导论",
        "teacher": "林翠秀",
        "room": "10#502"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "周永亮",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "摄影基础",
        "teacher": "隆颖",
        "room": "11#111数字融媒体采编实验室"
      },
      {
        "day": "周二",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "社区服务法律导论",
        "teacher": "林翠秀",
        "room": "10#502"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "摄影基础",
        "teacher": "隆颖",
        "room": "校外地点12"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "林涛",
        "room": "11#515"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "文化消费心理学",
        "teacher": "梅晓雪",
        "room": "10#501"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "李强",
        "room": "10#411"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "近现代史社会实践",
        "teacher": "江逸涵",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "摄影基础",
        "teacher": "隆颖",
        "room": "实训基地1（校外地点）"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "摄影基础",
        "teacher": "隆颖",
        "room": "11#111数字融媒体采编实验室"
      }
    ]
  },
  "25智能建造【本科】1班": {
    "major": "智能建造【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学A（上）",
        "teacher": "林响",
        "room": "5B410"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "梁云",
        "room": "11#513"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "韦艳赠",
        "room": "6B612-语音实验室(8)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "吴小菁",
        "room": "11#215"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "梁云",
        "room": "11#513"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "工程制图与识图",
        "teacher": "余洁歆",
        "room": "11#417"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "邓康乐",
        "room": "11#515"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "近现代史社会实践",
        "teacher": "梁云",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "工程制图与识图",
        "teacher": "余洁歆",
        "room": "11#319"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "韦艳赠",
        "room": "11#319"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "智能建造导论",
        "teacher": "王雅思",
        "room": "11#314"
      },
      {
        "day": "周三",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "11#320"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "11#320"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学A（上）",
        "teacher": "林响",
        "room": "12#413"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "刘日",
        "room": "11#210"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "陈亨明",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "林芳",
        "room": "11#418"
      }
    ]
  },
  "25智能建造【本科】2班": {
    "major": "智能建造【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "韦艳赠",
        "room": "6B612-语音实验室(8)"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "梁云",
        "room": "11#513"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学A（上）",
        "teacher": "林响",
        "room": "5B410"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "吴小菁",
        "room": "11#215"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "梁云",
        "room": "11#513"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学A（上）",
        "teacher": "林响",
        "room": "12#413"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "智能建造导论",
        "teacher": "陈津凯",
        "room": "11#314"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "11#320"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "李爽",
        "room": "11#320"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "智能建造导论",
        "teacher": "王雅思",
        "room": "11#314"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "韦艳赠",
        "room": "11#417"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "工程制图与识图",
        "teacher": "余洁歆",
        "room": "11#318"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "刘日",
        "room": "11#210"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "邓康乐",
        "room": "11#515"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "近现代史社会实践",
        "teacher": "梁云",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "林东序",
        "room": "田径运动场"
      }
    ]
  },
  "25法学(刑事法方向)【本科】1班": {
    "major": "法学(刑事法方向)【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "法理学",
        "teacher": "林坤",
        "room": "7号楼B506"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "张洁玲",
        "room": "7号楼C405"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "罗宁萍",
        "room": "7号楼B108"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "习近平法治思想概论",
        "teacher": "赵勇",
        "room": "7号楼C208"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "欧晓琳",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "宪法学",
        "teacher": "潘书宏",
        "room": "7号楼B201模拟法庭"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "黄玲",
        "room": "7号楼B107"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "杨焕江",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "法理学",
        "teacher": "林坤",
        "room": "7号楼B106"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "罗宁萍",
        "room": "7号楼B107"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "欧晓琳",
        "room": "7号楼C306"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "宪法学",
        "teacher": "潘书宏",
        "room": "7号楼C201"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "罗宁萍",
        "room": "7号楼B107"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "欧晓琳",
        "room": "7号楼C306"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "法理学",
        "teacher": "林坤",
        "room": "7号楼B105"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "陈士一",
        "room": "7号楼C405"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "杨焕江",
        "room": "简易篮球棚"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "形势与政策（1）",
        "teacher": "黄礼锵",
        "room": "7号楼C505"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "宪法学",
        "teacher": "潘书宏",
        "room": "7号楼C201"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "黄礼锵",
        "room": "7号楼C505"
      }
    ]
  },
  "25法学(国际法方向)【本科】1班": {
    "major": "法学(国际法方向)【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "法理学",
        "teacher": "吴玉姣",
        "room": "7号楼B508"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "罗宁萍",
        "room": "5C103"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "张洁玲",
        "room": "7号楼C405"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "法理学",
        "teacher": "吴玉姣",
        "room": "7号楼B508"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "陈秀琴",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "欧晓琳",
        "room": "7号楼C306"
      },
      {
        "day": "周一",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "宪法学",
        "teacher": "游志强",
        "room": "7号楼C201"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "欧晓琳",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "林凯",
        "room": "4A101"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "林凯",
        "room": "4A101"
      },
      {
        "day": "周三",
        "period": "2-4节",
        "time": "",
        "name": "宪法学",
        "teacher": "游志强",
        "room": "7号楼C201"
      },
      {
        "day": "周三",
        "period": "2-4节",
        "time": "",
        "name": "艺术基础素养",
        "teacher": "黄玲",
        "room": "7号楼B107"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "罗宁萍",
        "room": "5C413"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "习近平法治思想概论",
        "teacher": "赵勇",
        "room": "7号楼B201模拟法庭"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "梁云",
        "room": "11#512"
      },
      {
        "day": "周三",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "梁云",
        "room": "11#512"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "思想道德与法治",
        "teacher": "欧晓琳",
        "room": "7号楼C306"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "陈士一",
        "room": "7号楼C405"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "宪法学",
        "teacher": "游志强",
        "room": "7号楼C201"
      },
      {
        "day": "周六",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "罗宁萍",
        "room": "5C103"
      }
    ]
  },
  "25法学(民商法方向)【本科】1班": {
    "major": "法学(民商法方向)【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "法理学",
        "teacher": "杨阿丽",
        "room": "7B305-法学院智慧教室"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "张洁玲",
        "room": "7号楼C405"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "罗宁萍",
        "room": "7号楼B107"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "宪法学",
        "teacher": "潘书宏",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "宪法学",
        "teacher": "潘书宏",
        "room": "7号楼B201模拟法庭"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "黄玲",
        "room": "7号楼B107"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "罗宁萍",
        "room": "7号楼B107"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "法理学",
        "teacher": "杨阿丽",
        "room": "7B305-法学院智慧教室"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "欧晓琳",
        "room": "7号楼C306"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "宪法学",
        "teacher": "潘书宏",
        "room": "7号楼C201"
      },
      {
        "day": "周四",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "郑晓旋",
        "room": "4C314"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "郑晓旋",
        "room": "4C314"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "大学英语（1）",
        "teacher": "罗宁萍",
        "room": "7号楼B107"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "欧晓琳",
        "room": "9#501"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "习近平法治思想概论",
        "teacher": "赵勇",
        "room": "7号楼B201模拟法庭"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "吴敏",
        "room": "田径运动场"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "杨璟",
        "room": "4B507"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "宪法学",
        "teacher": "潘书宏",
        "room": "7号楼C201"
      },
      {
        "day": "周四",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "杨璟",
        "room": "4B507"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "陈士一",
        "room": "7号楼C405"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "思想道德与法治",
        "teacher": "欧晓琳",
        "room": "7号楼C306"
      }
    ]
  },
  "25法学(行政法方向)【本科】1班": {
    "major": "法学(行政法方向)【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "罗宁萍",
        "room": "5C103"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "法理学",
        "teacher": "吴玉姣",
        "room": "7号楼B207"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "法理学",
        "teacher": "吴玉姣",
        "room": "7号楼B508"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "宪法学",
        "teacher": "游志强",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "宋晓秋",
        "room": "7号楼C406"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "法理学",
        "teacher": "吴玉姣",
        "room": "7号楼B508"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "欧晓琳",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "思想道德与法治",
        "teacher": "欧晓琳",
        "room": "7号楼C306"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "宪法学",
        "teacher": "游志强",
        "room": "7号楼C201"
      },
      {
        "day": "周三",
        "period": "2-4节",
        "time": "",
        "name": "宪法学",
        "teacher": "游志强",
        "room": "7号楼C201"
      },
      {
        "day": "周三",
        "period": "2-4节",
        "time": "",
        "name": "大学生职业生涯规划",
        "teacher": "陈士一",
        "room": "7号楼C405"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "罗宁萍",
        "room": "5C413"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "习近平法治思想概论",
        "teacher": "赵勇",
        "room": "7号楼B201模拟法庭"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "许金富",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "杨璟",
        "room": "4B507"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "思想道德与法治",
        "teacher": "欧晓琳",
        "room": "7号楼C306"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "黄玲",
        "room": "7号楼B107"
      },
      {
        "day": "周五",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "林凯",
        "room": "4A101"
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "林凯",
        "room": "4A101"
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "德法社会实践",
        "teacher": "欧晓琳",
        "room": "校外地点12"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "杨璟",
        "room": "4B507"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "大学体育（1）",
        "teacher": "许金富",
        "room": "田径运动场"
      }
    ]
  },
  "25法学（财经法方向）（闽台合作4+0）【本科】1班": {
    "major": "法学（财经法方向）（闽台合作4+0）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "宪法学",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "法理学",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "宪法学",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "法理学",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "法理学",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:00-16:20",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "习近平法治思想概论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周日",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "",
        "room": ""
      }
    ]
  },
  "25法学（财经法方向）（闽台合作4+0）【本科】2班": {
    "major": "法学（财经法方向）（闽台合作4+0）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "宪法学",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "法理学",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "法理学",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "宪法学",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "法理学",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "习近平法治思想概论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "劳动教育",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周日",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "",
        "room": ""
      }
    ]
  },
  "25法语（国际电子商务方向）【本科】1班": {
    "major": "法语（国际电子商务方向）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "法语语音",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "基础语法（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "国际电子商务导论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "法语视听说（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      }
    ]
  },
  "25物业管理【本科】1班": {
    "major": "物业管理【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "张洁玲",
        "room": "7号楼C405"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "翁辉琳",
        "room": "6A604-语音实验室(3)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "赵春莹",
        "room": "7号楼C202"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "翁辉琳",
        "room": "7号楼C303"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "陈秀琴",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "林卉",
        "room": "7号楼C305"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "陈蔷",
        "room": "7号楼C201"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "林卉",
        "room": "7号楼C305"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "郭超",
        "room": "7号楼C303"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "思想道德与法治",
        "teacher": "林卉",
        "room": "7号楼C305"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "物业管理专业导论",
        "teacher": "肖志明",
        "room": "7号楼C305"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "艺术基础素养",
        "teacher": "郭超",
        "room": "7号楼C303"
      },
      {
        "day": "周四",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "陈玲",
        "room": "7号楼C405"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "陈玲",
        "room": "7号楼C405"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "高等数学D",
        "teacher": "赵春莹",
        "room": "7号楼C202"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "林卉",
        "room": "9#501"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "陈蔷",
        "room": "7号楼C307"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学D",
        "teacher": "赵春莹",
        "room": "7号楼C202"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "江逸涵",
        "room": "5C103"
      },
      {
        "day": "周四",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "江逸涵",
        "room": "5C103"
      },
      {
        "day": "周六",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "翁辉琳",
        "room": "7号楼C303"
      },
      {
        "day": "周六",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "德法社会实践",
        "teacher": "林卉",
        "room": "校外地点35"
      }
    ]
  },
  "25物联网工程【本科】1班": {
    "major": "物联网工程【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学R (上）",
        "teacher": "石志高",
        "room": "12#417"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "电路与电子技术",
        "teacher": "张振敏",
        "room": "12#316"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "电路与电子技术实验",
        "teacher": "张振敏",
        "room": "6C212-电工电路实验室"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "李桃",
        "room": "11#518"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "电路与电子技术实验",
        "teacher": "张振敏",
        "room": "12#411-物联网控制系统实验室"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学R (上）",
        "teacher": "石志高",
        "room": "12#417"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "物联网工程导论",
        "teacher": "王剑峰",
        "room": "12#317"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "11#320"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "11#320"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学R (上）",
        "teacher": "石志高",
        "room": "12#417"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "李桃",
        "room": "11#413"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "程序设计基础",
        "teacher": "陈慧",
        "room": "6B309-计算机基础实验室(5)"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "程序设计基础",
        "teacher": "陈慧",
        "room": "6B309-计算机基础实验室(5)"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "林建珠",
        "room": "11#209"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "陈晓静",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学英语（1）",
        "teacher": "林明",
        "room": "12#518"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "林明",
        "room": "11#518"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "近现代史社会实践",
        "teacher": "李桃",
        "room": "9#501"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "程序设计基础",
        "teacher": "陈慧",
        "room": "6B309-计算机基础实验室(5)"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "电路与电子技术实验",
        "teacher": "张振敏",
        "room": "6C212-电工电路实验室"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "郑思佳",
        "room": "11#516"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "电路与电子技术",
        "teacher": "张振敏",
        "room": "12#417"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "郑思佳",
        "room": "11#418"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "李煜",
        "room": "11#412"
      }
    ]
  },
  "25物联网工程【本科】2班": {
    "major": "物联网工程【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "程序设计基础",
        "teacher": "林雯",
        "room": "6B309-计算机基础实验室(5)"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学R (上）",
        "teacher": "石志高",
        "room": "12#417"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "物联网工程导论",
        "teacher": "王剑峰",
        "room": "12#317"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "11#320"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "李桃",
        "room": "11#518"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "电路与电子技术",
        "teacher": "张振敏",
        "room": "5A204"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "电路与电子技术实验",
        "teacher": "张振敏",
        "room": "6C212-电工电路实验室"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "林永春",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学R (上）",
        "teacher": "石志高",
        "room": "12#417"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "林建珠",
        "room": "11#209"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "电路与电子技术实验",
        "teacher": "张振敏",
        "room": "12#411-物联网控制系统实验室"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学英语（1）",
        "teacher": "林明",
        "room": "12#518"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "林明",
        "room": "11#518"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "电路与电子技术",
        "teacher": "张振敏",
        "room": "12#417"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "程序设计基础",
        "teacher": "林雯",
        "room": "6B309-计算机基础实验室(5)"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "郑思佳",
        "room": "11#516"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "电路与电子技术实验",
        "teacher": "张振敏",
        "room": "6C212-电工电路实验室"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "郑思佳",
        "room": "11#418"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "近现代史社会实践",
        "teacher": "李桃",
        "room": "9#501"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "李煜",
        "room": "11#412"
      }
    ]
  },
  "25物联网工程（专升本）1班": {
    "major": "物联网工程（专升本）",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "C语言程序设计",
        "teacher": "陈达贵",
        "room": "12#412-物联网工程项目及安全实验室"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "数据库开发与设计",
        "teacher": "张晖",
        "room": "12#411-物联网控制系统实验室"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "电路与电子技术",
        "teacher": "王锐",
        "room": "12#410"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "操作系统原理",
        "teacher": "刘文标",
        "room": "12#401传感网应用开发实验室"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "操作系统原理",
        "teacher": "刘文标",
        "room": "12#401传感网应用开发实验室"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "数据库开发与设计",
        "teacher": "张晖",
        "room": "12#411-物联网控制系统实验室"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "物联网工程导论",
        "teacher": "王剑峰",
        "room": "7号楼C204"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "电路与电子技术",
        "teacher": "王锐",
        "room": "12#410"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "张翠莲",
        "room": "11#209"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "近现代史社会实践",
        "teacher": "俞雅莲",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "计算机网络",
        "teacher": "李沃松",
        "room": "12#410"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "操作系统原理",
        "teacher": "刘文标",
        "room": "12#401传感网应用开发实验室"
      },
      {
        "day": "周一",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "张翠莲",
        "room": "11#209"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "C语言程序设计",
        "teacher": "陈达贵",
        "room": "6B310-计算机基础实验室(6)"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学体育（1）",
        "teacher": "夏博雯",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "数据库开发与设计",
        "teacher": "张晖",
        "room": "12#411-物联网控制系统实验室"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "电路与电子技术实验",
        "teacher": "王锐",
        "room": "12#411-物联网控制系统实验室"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "俞雅莲",
        "room": "9#103"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "俞雅莲",
        "room": "9#103"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "俞雅莲",
        "room": "校外地点18"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "C语言程序设计",
        "teacher": "陈达贵",
        "room": "6B310-计算机基础实验室(6)"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "计算机网络",
        "teacher": "李沃松",
        "room": "5A204"
      },
      {
        "day": "周六",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "夏博雯",
        "room": "田径运动场"
      }
    ]
  },
  "25物联网工程（闽台合作4+0）【本科】1班": {
    "major": "物联网工程（闽台合作4+0）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "7-9节",
        "time": "14:00-16:20",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "电路与电子技术实验",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "艺术基础素养",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "程序设计基础",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "电路与电子技术",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "7-10节",
        "time": "14:00-17:20",
        "name": "高等数学R (上）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "程序设计基础",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "劳动教育",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "高等数学R (上）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "7-10节",
        "time": "14:00-17:20",
        "name": "高等数学R (上）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周日",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "",
        "room": ""
      }
    ]
  },
  "25电子信息工程【本科】1班": {
    "major": "电子信息工程【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学A（上）",
        "teacher": "郑敏",
        "room": "12#415"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "徐琳",
        "room": "12#518"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "方慧兰",
        "room": "11#214"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "近现代史社会实践",
        "teacher": "李晓",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "李晓",
        "room": "11#210"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "李晓",
        "room": "11#210"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "杨玮",
        "room": "12#518"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学A（上）",
        "teacher": "郑敏",
        "room": "12#417"
      },
      {
        "day": "周三",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "许天蓝",
        "room": "12#518"
      },
      {
        "day": "周三",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "许天蓝",
        "room": "12#518"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "徐琳",
        "room": "12#518"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "方慧兰",
        "room": "11#214"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学A（上）",
        "teacher": "郑敏",
        "room": "12#516"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "王波",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "郑思佳",
        "room": "11#516"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "徐琳",
        "room": "12#518"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学A（上）",
        "teacher": "郑敏",
        "room": "12#415"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学体育（1）",
        "teacher": "王波",
        "room": "田径运动场"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "郑思佳",
        "room": "11#418"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "彭东玲",
        "room": "11#209"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "近现代史社会实践",
        "teacher": "李晓",
        "room": "校外地点34"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "彭东玲",
        "room": "11#209"
      }
    ]
  },
  "25电子信息工程【本科】2班": {
    "major": "电子信息工程【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "李晓",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "徐琳",
        "room": "12#518"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学A（上）",
        "teacher": "郑敏",
        "room": "12#415"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "许天蓝",
        "room": "12#518"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "许天蓝",
        "room": "12#518"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学A（上）",
        "teacher": "郑敏",
        "room": "12#415"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "方慧兰",
        "room": "11#214"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "徐琳",
        "room": "12#518"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "李锴",
        "room": "12#518"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "杨焕江",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "李晓",
        "room": "11#210"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "李晓",
        "room": "11#210"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "郑思佳",
        "room": "11#516"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "杨焕江",
        "room": "排球场（2）"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "徐琳",
        "room": "12#518"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "李晓",
        "room": "校外地点31"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "郑思佳",
        "room": "11#418"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "张如",
        "room": "11#215"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学A（上）",
        "teacher": "郑敏",
        "room": "12#415"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "张如",
        "room": "11#215"
      }
    ]
  },
  "25电子商务【本科】1班": {
    "major": "电子商务【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "蔡姝婷",
        "room": "9#202"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "车志红",
        "room": "9#202"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "电子商务技术基础（一）",
        "teacher": "韩力恒",
        "room": "11#508-经济社会大数据分析实验室"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "电子商务概论A",
        "teacher": "李捷",
        "room": "9#203"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "电子商务概论A",
        "teacher": "李捷",
        "room": "9#203"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "吴小菁",
        "room": "11#215"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "车志红",
        "room": "6B610-语音实验室(6)"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "陈振文",
        "room": "9#302"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "思想道德与法治",
        "teacher": "张翠莲",
        "room": "11#412"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "车志红",
        "room": "9#104"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "蔡姝婷",
        "room": "9#202"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "电子商务技术基础（一）",
        "teacher": "韩力恒",
        "room": "11#508-经济社会大数据分析实验室"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "张翠莲",
        "room": "11#412"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "德法社会实践",
        "teacher": "张翠莲",
        "room": "9#501"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "蔡姝婷",
        "room": "9#202"
      },
      {
        "day": "周四",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "周艳菊",
        "room": "11#211"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "周艳菊",
        "room": "11#211"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "吴敏",
        "room": "田径运动场"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "陈碧娇",
        "room": "11#412"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "邓晓君",
        "room": "11#211"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "汤宁鋆",
        "room": "11#514"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "陈碧娇",
        "room": "4B507"
      }
    ]
  },
  "25知识产权【本科】1班": {
    "major": "知识产权【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "程慧",
        "room": "6A604-语音实验室(3)"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "法理学",
        "teacher": "林坤",
        "room": "7号楼B506"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "习近平法治思想概论",
        "teacher": "赵勇",
        "room": "7号楼C208"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "宋晓秋",
        "room": "7号楼C406"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "法理学",
        "teacher": "林坤",
        "room": "7号楼B207"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "欧晓琳",
        "room": "7号楼C302"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "宪法学",
        "teacher": "潘书宏",
        "room": "7号楼B207"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "程慧",
        "room": "7号楼B106"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "宪法学",
        "teacher": "潘书宏",
        "room": "7号楼B210"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "程慧",
        "room": "7号楼B108"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "法理学",
        "teacher": "林坤",
        "room": "7号楼B106"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "林东序",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "黄玲",
        "room": "7号楼B107"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "法理学",
        "teacher": "林坤",
        "room": "7号楼B105"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "张云年",
        "room": "7号楼B106"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "德法社会实践",
        "teacher": "欧晓琳",
        "room": "9#501"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "陈士一",
        "room": "7号楼C405"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "张云年",
        "room": "7号楼B108"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "思想道德与法治",
        "teacher": "欧晓琳",
        "room": "7号楼C204"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "黄礼锵",
        "room": "7号楼C505"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "黄礼锵",
        "room": "7号楼C505"
      }
    ]
  },
  "25社会工作（现代社区服务专业群）1班": {
    "major": "社会工作（现代社区服务专业群）",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "社会学概论",
        "teacher": "陈晓煌",
        "room": "7号楼A203"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "程慧",
        "room": "5A506"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "陈晓静",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "谢明芳",
        "room": "5A101"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "程慧",
        "room": "4C104"
      },
      {
        "day": "周二",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "专业认知实训",
        "teacher": "李羿琼",
        "room": "6A505-社会工作综合实验室"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "许祥雁",
        "room": "4C104"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "近现代史社会实践",
        "teacher": "许祥雁",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "社会工作概论",
        "teacher": "郑玥",
        "room": "7号楼C505"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "社会学概论",
        "teacher": "陈晓煌",
        "room": "7号楼A203"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "邵雅利",
        "room": "4C314"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "程慧",
        "room": "4C104"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "谢明芳",
        "room": "5A101"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "专业认知实训",
        "teacher": "李羿琼",
        "room": "校外地点32"
      },
      {
        "day": "周三",
        "period": "5-6节",
        "time": "14:00-15:40",
        "name": "专业认知实训",
        "teacher": "李羿琼",
        "room": "校外地点32"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "邵雅利",
        "room": "4C314"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "邵丹妮",
        "room": "7号楼C306"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "许祥雁",
        "room": "4C104"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "人工智能导论",
        "teacher": "陈慧",
        "room": "4C314"
      },
      {
        "day": "周五",
        "period": "5-10节",
        "time": "",
        "name": "专业认知实训",
        "teacher": "李羿琼",
        "room": "校外地点32"
      },
      {
        "day": "周五",
        "period": "5-8节",
        "time": "",
        "name": "成长小组",
        "teacher": "苏海贵",
        "room": "6A505-社会工作综合实验室"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学D",
        "teacher": "谢明芳",
        "room": "5A101"
      }
    ]
  },
  "25社会工作（现代社区服务专业群）2班": {
    "major": "社会工作（现代社区服务专业群）",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "程慧",
        "room": "5A506"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "成长小组",
        "teacher": "苏海贵",
        "room": "6A505-社会工作综合实验室"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "社会学概论",
        "teacher": "陈晓煌",
        "room": "7号楼A204"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "谢明芳",
        "room": "5A101"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "专业认知实训",
        "teacher": "李羿琼",
        "room": "校外地点32"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "社会学概论",
        "teacher": "陈晓煌",
        "room": "7号楼A401"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "林东序",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "专业认知实训",
        "teacher": "李羿琼",
        "room": "6A505-社会工作综合实验室"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "许祥雁",
        "room": "4C104"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "邵雅利",
        "room": "4C314"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "邵丹妮",
        "room": "7号楼C306"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "社会工作概论",
        "teacher": "郑玥",
        "room": "7号楼C505"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "许祥雁",
        "room": "4C104"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "邵雅利",
        "room": "4C314"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "程慧",
        "room": "4C104"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "谢明芳",
        "room": "5A101"
      },
      {
        "day": "周四",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "专业认知实训",
        "teacher": "李羿琼",
        "room": "校外地点34"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "专业认知实训",
        "teacher": "李羿琼",
        "room": "6A505-社会工作综合实验室"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "邵雅利",
        "room": "11#514"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "人工智能导论",
        "teacher": "陈慧",
        "room": "4C314"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "社会学概论",
        "teacher": "陈晓煌",
        "room": "7号楼A401"
      }
    ]
  },
  "25税收学【本科】1班": {
    "major": "税收学【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "黄瑢",
        "room": "4B410"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "刘志芳",
        "room": "4B407"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "袁晗",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "商务基础与专业导论A",
        "teacher": "刘建伟",
        "room": "4A501"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "会计学原理A",
        "teacher": "周融",
        "room": "4B408"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "黄瑢",
        "room": "6B611-语音实验室(7)"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "李桃",
        "room": "11#413"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "刘宝璠",
        "room": "4A606"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "政治经济学C",
        "teacher": "康迎春",
        "room": "4B507"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "卓琳",
        "room": "4C314"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "陈雪婷",
        "room": "4B407"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "会计学原理A",
        "teacher": "周融",
        "room": "4B206"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "形势与政策（1）",
        "teacher": "陈茂林",
        "room": "4B607"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "黄瑢",
        "room": "4B410"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "李桃",
        "room": "校外地点32"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "陈雪婷",
        "room": "4B407"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "李桃",
        "room": "11#413"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "近现代史社会实践",
        "teacher": "李桃",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "袁晗",
        "room": "排球场（1）"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学D",
        "teacher": "刘志芳",
        "room": "4B407"
      },
      {
        "day": "周三",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "陈茂林",
        "room": "4B607"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "高等数学D",
        "teacher": "刘志芳",
        "room": "4B407"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "商务基础与专业导论A",
        "teacher": "刘建伟",
        "room": "4B508"
      }
    ]
  },
  "25税收学【本科】2班": {
    "major": "税收学【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "张叶云",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "刘志芳",
        "room": "4B407"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "黄瑢",
        "room": "4B410"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "张叶云",
        "room": "4C413"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "黄瑢",
        "room": "6B611-语音实验室(7)"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "会计学原理A",
        "teacher": "周融",
        "room": "4B408"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "商务基础与专业导论A",
        "teacher": "刘建伟",
        "room": "4A501"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "刘宝璠",
        "room": "4A606"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "政治经济学C",
        "teacher": "康迎春",
        "room": "4B507"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "卓琳",
        "room": "4C314"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "张叶云",
        "room": "4C413"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "商务基础与专业导论A",
        "teacher": "刘建伟",
        "room": "4B511"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "陈雪婷",
        "room": "4B407"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "黄瑢",
        "room": "4B410"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "陈雪婷",
        "room": "4B407"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "沈洲",
        "room": "4B407"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "柯亮",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "沈洲",
        "room": "4B407"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "高等数学D",
        "teacher": "刘志芳",
        "room": "4B407"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "会计学原理A",
        "teacher": "周融",
        "room": "4A502"
      },
      {
        "day": "周六",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "近现代史社会实践",
        "teacher": "张叶云",
        "room": "校外地点28"
      },
      {
        "day": "周六",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "柯亮",
        "room": "田径运动场"
      },
      {
        "day": "周日",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学D",
        "teacher": "刘志芳",
        "room": "4B407"
      }
    ]
  },
  "25经济学【本科】1班": {
    "major": "经济学【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "车志红",
        "room": "11#512"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "跨境电商导论B",
        "teacher": "陈芳",
        "room": "9#201"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "谢鸿",
        "room": "11#514"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "艺术基础素养",
        "teacher": "陈碧娇",
        "room": "11#512"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "应用写作与表达（财经类）",
        "teacher": "胡小梅",
        "room": "9#302"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "高等数学C",
        "teacher": "谢鸿",
        "room": "11#514"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "薛嵩剑",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "张翠莲",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "吴珏",
        "room": "11#514"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "张翠莲",
        "room": "11#412"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "车志红",
        "room": "11#412"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "谢鸿",
        "room": "11#512"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "车志红",
        "room": "11#412"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "王志锴",
        "room": "11#512"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "人工智能导论",
        "teacher": "卓琳",
        "room": "4C314"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "车志红",
        "room": "11#412"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "谢鸿",
        "room": "11#514"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "张翠莲",
        "room": "11#413"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学C",
        "teacher": "吴珏",
        "room": "11#512"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "王志锴",
        "room": "11#512"
      }
    ]
  },
  "25经济学【本科】2班": {
    "major": "经济学【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "车志红",
        "room": "11#512"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "跨境电商导论B",
        "teacher": "陈芳",
        "room": "9#104"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "吴珏",
        "room": "11#514"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "张翠莲",
        "room": "11#412"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生职业生涯规划",
        "teacher": "王志锴",
        "room": "11#512"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "谢飞",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "谢鸿",
        "room": "11#514"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "艺术基础素养",
        "teacher": "陈碧娇",
        "room": "11#512"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "车志红",
        "room": "11#412"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "张翠莲",
        "room": "11#413"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学C",
        "teacher": "吴珏",
        "room": "11#512"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "王志锴",
        "room": "11#512"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "胡小梅",
        "room": "9#201"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "高等数学C",
        "teacher": "谢鸿",
        "room": "11#514"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "人工智能导论",
        "teacher": "卓琳",
        "room": "4C314"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "德法社会实践",
        "teacher": "张翠莲",
        "room": "9#501"
      }
    ]
  },
  "25经济统计学【本科】1班": {
    "major": "经济统计学【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "政治经济学C",
        "teacher": "国常宁",
        "room": "5C413"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "邱伟强",
        "room": "5C104"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "吴晔",
        "room": "5A204"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "金融学A",
        "teacher": "阮永锋",
        "room": "5B209"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "金融学A",
        "teacher": "阮永锋",
        "room": "5C414"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "黄佳作",
        "room": "5A406"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "邱伟强",
        "room": "5C104"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "蔡昌文",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "韩雅清",
        "room": "5A302-国际金融实验室"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "翁朝霞",
        "room": "5A506"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "德法社会实践",
        "teacher": "黄佳作",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "Office办公自动化",
        "teacher": "杨华",
        "room": "5B309-货币与票据防伪实验室"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "政治经济学C",
        "teacher": "国常宁",
        "room": "5A101"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "金融学A",
        "teacher": "阮永锋",
        "room": "5B210"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "吴晔",
        "room": "5A204"
      },
      {
        "day": "周三",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学体育（1）",
        "teacher": "蔡昌文",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "黄佳作",
        "room": "5A406"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "揭红兰",
        "room": "5C103"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学语文",
        "teacher": "邱维平",
        "room": "5A402"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "黄佳作",
        "room": "5A406"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "金融学A",
        "teacher": "阮永锋",
        "room": "5A201"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "人工智能导论",
        "teacher": "高晓",
        "room": "5C413"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "高等数学C",
        "teacher": "吴晔",
        "room": "5A204"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "金融学A",
        "teacher": "阮永锋",
        "room": "5B209"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "Office办公自动化",
        "teacher": "杨华",
        "room": "6A305-计算机基础实验室(3)"
      }
    ]
  },
  "25经济统计学【本科】2班": {
    "major": "经济统计学【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "政治经济学C",
        "teacher": "国常宁",
        "room": "5C413"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "黄佳作",
        "room": "5A406"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "邱伟强",
        "room": "5C104"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "吴晔",
        "room": "5A204"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "金融学A",
        "teacher": "黄晓婷",
        "room": "5C413"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "高等数学C",
        "teacher": "吴晔",
        "room": "5A204"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "邱伟强",
        "room": "5C104"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "艺术基础素养",
        "teacher": "翁朝霞",
        "room": "5A506"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "金融学A",
        "teacher": "黄晓婷",
        "room": "5B409"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "金融学A",
        "teacher": "黄晓婷",
        "room": "5A405"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "林永春",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "黄佳作",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "吴晔",
        "room": "5A204"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "Office办公自动化",
        "teacher": "杨华",
        "room": "6B310-计算机基础实验室(6)"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "黄佳作",
        "room": "5A406"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "揭红兰",
        "room": "5C103"
      },
      {
        "day": "周三",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "韩雅清",
        "room": "5B310-金融科技实验室"
      },
      {
        "day": "周三",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "人工智能导论",
        "teacher": "高晓",
        "room": "5C413"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学C",
        "teacher": "吴晔",
        "room": "5A204"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "黄佳作",
        "room": "5A406"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "金融学A",
        "teacher": "黄晓婷",
        "room": "5A201"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学语文",
        "teacher": "邱维平",
        "room": "5A402"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "政治经济学C",
        "teacher": "国常宁",
        "room": "5A101"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "金融学A",
        "teacher": "黄晓婷",
        "room": "5C104"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "Office办公自动化",
        "teacher": "杨华",
        "room": "5B307-量化投资实验室"
      }
    ]
  },
  "25艺术设计学（品牌设计方向）【本科】1班": {
    "major": "艺术设计学（品牌设计方向）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1-3节",
        "time": "",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "近现代史社会实践",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "7-10节",
        "time": "14:00-17:20",
        "name": "计算机辅助设计",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "设计概论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "近现代史社会实践",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      }
    ]
  },
  "25艺术设计学（服务设计方向）【本科】1班": {
    "major": "艺术设计学（服务设计方向）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "服务设计概论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "中国近现代史纲要",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周二",
        "period": "1-3节",
        "time": "",
        "name": "形势与政策（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "近现代史社会实践",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "7-10节",
        "time": "14:00-17:20",
        "name": "造型基础",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周五",
        "period": "7-10节",
        "time": "14:00-17:20",
        "name": "计算机辅助设计",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "1节",
        "time": "",
        "name": "）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周六",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "",
        "room": ""
      },
      {
        "day": "周日",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "",
        "room": ""
      }
    ]
  },
  "25行政管理【本科】1班": {
    "major": "行政管理【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "社会学原理",
        "teacher": "洪瑜",
        "room": "7号楼A201"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "吴宇宁",
        "room": "7号楼A204"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "宋晓秋",
        "room": "7号楼C406"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "许祥雁",
        "room": "4C104"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "邵雅利",
        "room": "4C314"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "林婧",
        "room": "4C104"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "袁晗",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "邵丹妮",
        "room": "7号楼C306"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学英语（1）",
        "teacher": "林婧",
        "room": "4A406"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "社会学原理",
        "teacher": "洪瑜",
        "room": "7号楼A201"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "林婧",
        "room": "4C104"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学语文",
        "teacher": "周艳菊",
        "room": "7号楼A204"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "邵雅利",
        "room": "11#517"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "邵雅利",
        "room": "4C314"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "吴宇宁",
        "room": "7号楼A302"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "邵雅利",
        "room": "4A406"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "许祥雁",
        "room": "4C104"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "张前贵",
        "room": "7号楼C406"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "近现代史社会实践",
        "teacher": "许祥雁",
        "room": "9#501"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "近现代史社会实践",
        "teacher": "许祥雁",
        "room": "校外地点21"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "张前贵",
        "room": "7号楼C406"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "大学生心理健康教育",
        "teacher": "邵雅利",
        "room": "11#516"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学语文",
        "teacher": "周艳菊",
        "room": "7号楼A204"
      },
      {
        "day": "周六",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "袁晗",
        "room": "田径运动场"
      },
      {
        "day": "周六",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "高等数学D",
        "teacher": "吴宇宁",
        "room": "7号楼A204"
      }
    ]
  },
  "25行政管理【本科】2班": {
    "major": "行政管理【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "社会学原理",
        "teacher": "洪瑜",
        "room": "7号楼A301"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "林婧",
        "room": "4C104"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "吴宇宁",
        "room": "7号楼A204"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "邵雅利",
        "room": "4C314"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学体育（1）",
        "teacher": "周永亮",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "社会学原理",
        "teacher": "洪瑜",
        "room": "7号楼A301"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "林婧",
        "room": "4C104"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "许祥雁",
        "room": "4C104"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "吴宇宁",
        "room": "7号楼A302"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "邵雅利",
        "room": "4A406"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学语文",
        "teacher": "周艳菊",
        "room": "7号楼A204"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "许祥雁",
        "room": "4C104"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "邵丹妮",
        "room": "7号楼C306"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学英语（1）",
        "teacher": "林婧",
        "room": "4A406"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "邵雅利",
        "room": "4C314"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "人工智能导论",
        "teacher": "陈慧",
        "room": "4C314"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "周永亮",
        "room": "田径运动场"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "张前贵",
        "room": "7号楼C406"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "张前贵",
        "room": "7号楼C406"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "近现代史社会实践",
        "teacher": "许祥雁",
        "room": "9#501"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "邵雅利",
        "room": "11#516"
      },
      {
        "day": "周六",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "近现代史社会实践",
        "teacher": "许祥雁",
        "room": "校外地点31"
      },
      {
        "day": "周六",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "高等数学D",
        "teacher": "吴宇宁",
        "room": "7号楼A204"
      }
    ]
  },
  "25财务管理【本科】1班": {
    "major": "财务管理【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "商务基础与专业导论A",
        "teacher": "邱海辉",
        "room": "4B511"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "会计学原理A",
        "teacher": "陈小慧,魏远竹",
        "room": "4B206"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "鄢仁政",
        "room": "4B411"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "形势与政策（1）",
        "teacher": "黄佳作",
        "room": "4A506"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "郑美香",
        "room": "4C314"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "形势与政策（1）",
        "teacher": "黄佳作",
        "room": "4A406"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "商务基础与专业导论A",
        "teacher": "邱海辉",
        "room": "4B411"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "近现代史社会实践",
        "teacher": "张叶云",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "陈浩",
        "room": "4A406"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "张叶云",
        "room": "4C413"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "会计学原理实训",
        "teacher": "林琳",
        "room": "4B410"
      },
      {
        "day": "周一",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "黄佳作",
        "room": "4A406"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "刘宝璠",
        "room": "4A606"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "会计学原理A",
        "teacher": "陈小慧",
        "room": "4B206"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "鄢仁政",
        "room": "4B411"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "高等数学D",
        "teacher": "鄢仁政",
        "room": "4B411"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "谢飞",
        "room": "田径运动场"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "会计学原理A",
        "teacher": "魏远竹",
        "room": "4B206"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "郑美香",
        "room": "4A406"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "张叶云",
        "room": "4C413"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生心理健康教育",
        "teacher": "陈浩",
        "room": "4A406"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "刘宝璠",
        "room": "4A606"
      },
      {
        "day": "周四",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "会计学原理实训",
        "teacher": "林琳",
        "room": "4B410"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "人工智能导论",
        "teacher": "陈慧",
        "room": "4C314"
      }
    ]
  },
  "25财务管理【本科】2班": {
    "major": "财务管理【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "任立民",
        "room": "4A501"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "张叶云",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "会计学原理实训",
        "teacher": "林琳",
        "room": "4B412"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "郑美香",
        "room": "4C314"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "会计学原理A",
        "teacher": "陈小慧",
        "room": "4B206"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "黄佳作",
        "room": "4A406"
      },
      {
        "day": "周一",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "黄佳作",
        "room": "4A406"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "任立民",
        "room": "4A501"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "谢玉枚",
        "room": "5C103"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "会计学原理实训",
        "teacher": "林琳",
        "room": "4B412"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "郑美香",
        "room": "4A406"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "张叶云",
        "room": "4C413"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生心理健康教育",
        "teacher": "陈浩",
        "room": "4A406"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生职业生涯规划",
        "teacher": "刘宝璠",
        "room": "4A606"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "形势与政策（1）",
        "teacher": "黄佳作",
        "room": "4A506"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "张叶云",
        "room": "4C413"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "谢飞",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "会计学原理A",
        "teacher": "陈小慧",
        "room": "4B206"
      },
      {
        "day": "周二",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "会计学原理实训",
        "teacher": "林琳",
        "room": "4B412"
      },
      {
        "day": "周二",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "商务基础与专业导论A",
        "teacher": "邱海辉",
        "room": "4A404"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "商务基础与专业导论A",
        "teacher": "邱海辉",
        "room": "4B411"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "陈浩",
        "room": "4A406"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "刘宝璠",
        "room": "4A606"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "人工智能导论",
        "teacher": "谢玉枚",
        "room": "5C103"
      }
    ]
  },
  "25财务管理（专升本）1班": {
    "major": "财务管理（专升本）",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "财务会计A",
        "teacher": "林婷",
        "room": "4A504"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "财务管理综合实训",
        "teacher": "徐青",
        "room": "4A404"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "张叶云",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "财务管理综合实训",
        "teacher": "徐青",
        "room": "4A404"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "夏博雯",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "张叶云",
        "room": "4C413"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "经济法（CPA)",
        "teacher": "沈永敏",
        "room": "4B408"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "张叶云",
        "room": "4C413"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "公司战略与风险管理（CPA)",
        "teacher": "杜亚飞",
        "room": "4A601"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "财务管理学",
        "teacher": "薛菁",
        "room": "4B206"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "管理学原理B",
        "teacher": "张涛",
        "room": "4A501"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "会计基础A",
        "teacher": "苏回水",
        "room": "4B410"
      },
      {
        "day": "周二",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "财务管理综合实训",
        "teacher": "徐青",
        "room": "4A403"
      },
      {
        "day": "周二",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "经济学B",
        "teacher": "林璐龙",
        "room": "4B412"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "会计基础A",
        "teacher": "苏回水",
        "room": "4A406"
      },
      {
        "day": "周二",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "财务管理综合实训",
        "teacher": "徐青",
        "room": "4A403"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "财务会计A",
        "teacher": "林婷",
        "room": "4A503"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "经济法（CPA)",
        "teacher": "沈永敏",
        "room": "4B408"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "财务管理学",
        "teacher": "薛菁",
        "room": "4B206"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "经济学B",
        "teacher": "林璐龙",
        "room": "4A404"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "江金龙",
        "room": "4A506"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "江金龙",
        "room": "4A506"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "近现代史社会实践",
        "teacher": "张叶云",
        "room": "校外地点13"
      }
    ]
  },
  "25财务管理（闽台合作4+0）【本科】1班": {
    "major": "财务管理（闽台合作4+0）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "张佩兰",
        "room": "5A101"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "郭剑晶",
        "room": "5B208"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "郭剑晶",
        "room": "5B208"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "会计学原理A",
        "teacher": "萧小芬",
        "room": "4A406"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "德法社会实践",
        "teacher": "张佩兰",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "郭剑晶",
        "room": "4B208"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "高等数学D",
        "teacher": "颜峰坡",
        "room": "4B407"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "颜峰坡",
        "room": "4A406"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "商务基础与专业导论A",
        "teacher": "邱海辉",
        "room": "4A404"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "人工智能导论",
        "teacher": "陈星娥",
        "room": "4C413"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "商务基础与专业导论A",
        "teacher": "邱海辉",
        "room": "4B411"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "4C413"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "颜峰坡",
        "room": "4A101"
      },
      {
        "day": "周四",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学生职业生涯规划",
        "teacher": "杨颖",
        "room": "4A506"
      },
      {
        "day": "周四",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "高等数学D",
        "teacher": "颜峰坡",
        "room": "4A506"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "柯亮",
        "room": "田径运动场"
      },
      {
        "day": "周四",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "会计学原理A",
        "teacher": "萧小芬",
        "room": "4A401"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "艺术基础素养",
        "teacher": "陈碧娇",
        "room": "12#317"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "杨颖",
        "room": "11#514"
      },
      {
        "day": "周五",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "郑元叶",
        "room": "11#210"
      }
    ]
  },
  "25资产评估【本科】1班": {
    "major": "资产评估【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "商务基础与专业导论A",
        "teacher": "林进添",
        "room": "4B408"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "中国近现代史纲要",
        "teacher": "张叶云",
        "room": "4C413"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "吴晓晖",
        "room": "4B411"
      },
      {
        "day": "周一",
        "period": "1-4节",
        "time": "08:20-12:00",
        "name": "会计学原理实训",
        "teacher": "郭岚",
        "room": "4B410"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学日语（1）",
        "teacher": "林韵",
        "room": "4C104"
      },
      {
        "day": "周一",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "大学日语（1）",
        "teacher": "林韵",
        "room": "4C104"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "吴晓晖",
        "room": "4B411"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "刘志芳",
        "room": "4B410"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "商务基础与专业导论A",
        "teacher": "林进添",
        "room": "4A405"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "会计学原理A",
        "teacher": "周融",
        "room": "4A502"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "会计学原理实训",
        "teacher": "郭岚",
        "room": "4B412"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "江武贵",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "会计学原理实训",
        "teacher": "郭岚",
        "room": "4B412"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "近现代史社会实践",
        "teacher": "张叶云",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生心理健康教育",
        "teacher": "张云年",
        "room": "4B206"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "人工智能导论",
        "teacher": "谢玉枚",
        "room": "5C103"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "大学日语（1）",
        "teacher": "林韵",
        "room": "4C104"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生心理健康教育",
        "teacher": "张云年",
        "room": "4A404"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "吴冰",
        "room": "4C104"
      }
    ]
  },
  "25金融学（SQA-AD项目）【本科】1班": {
    "major": "金融学（SQA-AD项目）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "雅思口语（1）",
        "teacher": "宋立林",
        "room": "4B509"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "雅思写作（1）",
        "teacher": "笪婷婷",
        "room": "12#209"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "张深林",
        "room": "4A203"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "林永春",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "陈雅茹",
        "room": "5B407"
      },
      {
        "day": "周一",
        "period": "9-12节",
        "time": "",
        "name": "大学生职业生涯规划",
        "teacher": "陈雅茹",
        "room": "5B407"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "林卉",
        "room": "7号楼C505"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "张深林",
        "room": "12#315"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "艺术基础素养",
        "teacher": "黄玲",
        "room": "5C103"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "雅思听力（1）",
        "teacher": "叶逢源",
        "room": "6A605-语音实验室(4)"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "雅思阅读（1）",
        "teacher": "王鸽",
        "room": "12#211"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "郑晓旋",
        "room": "12#209"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "雅思写作（1）",
        "teacher": "笪婷婷",
        "room": "5A205"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "林卉",
        "room": "7号楼C405"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "郑晓旋",
        "room": "12#415"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "雅思听力（1）",
        "teacher": "叶逢源",
        "room": "6A605-语音实验室(4)"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "人工智能导论",
        "teacher": "陈星娥",
        "room": "5C104"
      },
      {
        "day": "周四",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "唐宇杰",
        "room": "5A406"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "唐宇杰",
        "room": "5A406"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "雅思口语（1）",
        "teacher": "宋立林",
        "room": "7号楼C303"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "德法社会实践",
        "teacher": "林卉",
        "room": "9#501"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "雅思阅读（1）",
        "teacher": "王鸽",
        "room": "12#213"
      }
    ]
  },
  "25金融学（SQA-AD项目）【本科】2班": {
    "major": "金融学（SQA-AD项目）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "张深林",
        "room": "12#315"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "雅思听力（1）",
        "teacher": "叶逢源",
        "room": "6A604-语音实验室(3)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "雅思口语（1）",
        "teacher": "宋立林",
        "room": "4B509"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "雅思写作（1）",
        "teacher": "笪婷婷",
        "room": "12#209"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "陈雅茹",
        "room": "5B407"
      },
      {
        "day": "周一",
        "period": "9-12节",
        "time": "",
        "name": "大学生职业生涯规划",
        "teacher": "陈雅茹",
        "room": "5B407"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "林卉",
        "room": "7号楼C505"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "应用写作与表达（财经类）",
        "teacher": "郑晓旋",
        "room": "12#209"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "郭平华",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "雅思口语（1）",
        "teacher": "宋立林",
        "room": "5B410"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "应用写作与表达（财经类）",
        "teacher": "郑晓旋",
        "room": "12#415"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "黄玲",
        "room": "5C103"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "雅思阅读（1）",
        "teacher": "王鸽",
        "room": "12#211"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "林卉",
        "room": "7号楼C505"
      },
      {
        "day": "周三",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "雅思听力（1）",
        "teacher": "叶逢源",
        "room": "6A605-语音实验室(4)"
      },
      {
        "day": "周三",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "人工智能导论",
        "teacher": "陈星娥",
        "room": "5C104"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "张深林",
        "room": "12#315"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "林卉",
        "room": "7号楼C405"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "雅思写作（1）",
        "teacher": "笪婷婷",
        "room": "5A205"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "德法社会实践",
        "teacher": "林卉",
        "room": "9#501"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "雅思口语（1）",
        "teacher": "宋立林",
        "room": "12#211"
      },
      {
        "day": "周四",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "唐宇杰",
        "room": "5A406"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "雅思阅读（1）",
        "teacher": "王鸽",
        "room": "12#213"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "雅思写作（1）",
        "teacher": "笪婷婷",
        "room": "12#211"
      }
    ]
  },
  "25金融学（融资租赁方向）【本科】1班": {
    "major": "金融学（融资租赁方向）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "微观经济学B",
        "teacher": "林立达",
        "room": "5B409"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "何洪娟",
        "room": "6B610-语音实验室(6)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "姜金花",
        "room": "5A406"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "王剑凌",
        "room": "5A203"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "王剑凌",
        "room": "5A203"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "张雷",
        "room": "5C314-商业银行营业厅3D实战演练"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "姜金花",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "林兴",
        "room": "5C314-商业银行营业厅3D实战演练"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "王剑凌",
        "room": "5A203"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学语文",
        "teacher": "郑美平",
        "room": "5A404"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学体育（1）",
        "teacher": "叶宋忠",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "微观经济学B",
        "teacher": "林立达",
        "room": "5B408"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "翁朝霞",
        "room": "5A201"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "姜金花",
        "room": "5A406"
      },
      {
        "day": "周四",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "邱维平",
        "room": "5C104"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "邱维平",
        "room": "5C104"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "何洪娟",
        "room": "5B209"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "人工智能导论",
        "teacher": "高晓",
        "room": "5C413"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "林卉",
        "room": "5C413"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "揭红兰",
        "room": "5C103"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "高等数学C",
        "teacher": "王剑凌",
        "room": "5A203"
      }
    ]
  },
  "25金融学（金融学方向）【本科】1班": {
    "major": "金融学（金融学方向）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "微观经济学B",
        "teacher": "林立达",
        "room": "5B409"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "王剑凌",
        "room": "5A203"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "张雷",
        "room": "5C314-商业银行营业厅3D实战演练"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "王鸽",
        "room": "5A201"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "王鸽",
        "room": "5A201"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "王剑凌",
        "room": "5A203"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "谢珍萍",
        "room": "5A406"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "艺术基础素养",
        "teacher": "翁朝霞",
        "room": "5A201"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "思想道德与法治",
        "teacher": "谢珍萍",
        "room": "5A101"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "德法社会实践",
        "teacher": "谢珍萍",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "微观经济学B",
        "teacher": "林立达",
        "room": "5A201"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "王鸽",
        "room": "5A201"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "袁晗",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "高晓",
        "room": "5C413"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "谢珍萍",
        "room": "5A406"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "微观经济学B",
        "teacher": "林立达",
        "room": "5B408"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学语文",
        "teacher": "郑美平",
        "room": "5A404"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学生职业生涯规划",
        "teacher": "揭红兰",
        "room": "5C103"
      },
      {
        "day": "周五",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "谢珍萍",
        "room": "5A406"
      },
      {
        "day": "周五",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "黄佳作",
        "room": "5A406"
      }
    ]
  },
  "25金融学（闽台合作4+0）【本科】1班": {
    "major": "金融学（闽台合作4+0）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "黄菲菲",
        "room": "7号楼A202"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "夏宇",
        "room": "5B206"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "李锴",
        "room": "4C314"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C208"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "胡凌云",
        "room": "4B607"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "胡凌云",
        "room": "4B607"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "微观经济学B",
        "teacher": "庄新霞",
        "room": "5B208"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "黄菲菲",
        "room": "6A605-语音实验室(4)"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C208"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "德法社会实践",
        "teacher": "胡凌云",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "夏宇",
        "room": "4B511"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学语文",
        "teacher": "徐涓",
        "room": "4A401"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "徐俊辉",
        "room": "5A506"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "形势与政策（1）",
        "teacher": "李衡荣",
        "room": "4A606"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "胡凌云",
        "room": "4B607"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "黄菲菲",
        "room": "6A605-语音实验室(4)"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "张雷",
        "room": "5B207"
      },
      {
        "day": "周二",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "黄礼锵",
        "room": "4A606"
      },
      {
        "day": "周二",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "艺术基础素养",
        "teacher": "翁朝霞",
        "room": "4B607"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C208"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "微观经济学B",
        "teacher": "庄新霞",
        "room": "4A505"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学语文",
        "teacher": "徐涓",
        "room": "4B207"
      }
    ]
  },
  "25金融学（闽台合作4+0）【本科】2班": {
    "major": "金融学（闽台合作4+0）【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "人工智能导论",
        "teacher": "李锴",
        "room": "4C314"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C208"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "黄菲菲",
        "room": "7号楼A202"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学D",
        "teacher": "夏宇",
        "room": "4B511"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "德法社会实践",
        "teacher": "张佩兰",
        "room": "9#501"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "夏宇",
        "room": "4B512"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "张佩兰",
        "room": "5C414"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "张雷",
        "room": "5B411"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学体育（1）",
        "teacher": "周永亮",
        "room": "啦啦操馆（3）"
      },
      {
        "day": "周二",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "微观经济学B",
        "teacher": "庄新霞",
        "room": "5B210"
      },
      {
        "day": "周二",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C208"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "黄菲菲",
        "room": "6A604-语音实验室(3)"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "微观经济学B",
        "teacher": "庄新霞",
        "room": "4A505"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学生职业生涯规划",
        "teacher": "徐俊辉",
        "room": "5A506"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "周永亮",
        "room": "田径运动场"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "林兴",
        "room": "5B411"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "思想道德与法治",
        "teacher": "张佩兰",
        "room": "5C103"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "胡凌云",
        "room": "12#418"
      },
      {
        "day": "周二",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "胡凌云",
        "room": "12#418"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C208"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学语文",
        "teacher": "周艳菊",
        "room": "7号楼A202"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "翁朝霞",
        "room": "4B607"
      }
    ]
  },
  "25金融工程【本科】1班": {
    "major": "金融工程【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "邱伟强",
        "room": "5B210"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "微观经济学B",
        "teacher": "杨秋鸾",
        "room": "5B411"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "黄丽容",
        "room": "5A202"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "德法社会实践",
        "teacher": "谢珍萍",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "黄佳作",
        "room": "5A406"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学英语（1）",
        "teacher": "邱伟强",
        "room": "5B410"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "揭红兰",
        "room": "4C314"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "艺术基础素养",
        "teacher": "翁朝霞",
        "room": "5A201"
      },
      {
        "day": "周一",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "思想道德与法治",
        "teacher": "谢珍萍",
        "room": "5A406"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "邱伟强",
        "room": "6A604-语音实验室(3)"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "黄丽容",
        "room": "5A202"
      },
      {
        "day": "周三",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "谢珍萍",
        "room": "5A406"
      },
      {
        "day": "周三",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "思想道德与法治",
        "teacher": "谢珍萍",
        "room": "5A101"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "人工智能导论",
        "teacher": "谢玉枚",
        "room": "5C103"
      },
      {
        "day": "周三",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "谢珍萍",
        "room": "5A406"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "微观经济学B",
        "teacher": "杨秋鸾",
        "room": "5A401"
      },
      {
        "day": "周三",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "曾正滋",
        "room": "4A406"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学语文",
        "teacher": "陈庆华",
        "room": "5A203"
      },
      {
        "day": "周三",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学体育（1）",
        "teacher": "郭平华",
        "room": "田径运动场"
      },
      {
        "day": "周五",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "邱维平",
        "room": "5C104"
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "邱维平",
        "room": "5C104"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "曾正滋",
        "room": "4A406"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学语文",
        "teacher": "陈庆华",
        "room": "5A201"
      }
    ]
  },
  "25金融科技【本科】1班": {
    "major": "金融科技【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学C",
        "teacher": "黄丽容",
        "room": "5A202"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "林东序",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "思想道德与法治",
        "teacher": "黄佳作",
        "room": "5A404"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "微观经济学B",
        "teacher": "杨秋鸾",
        "room": "5A204"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学英语（1）",
        "teacher": "邱伟强",
        "room": "5B210"
      },
      {
        "day": "周二",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "思想道德与法治",
        "teacher": "黄佳作",
        "room": "5A404"
      },
      {
        "day": "周二",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "邱伟强",
        "room": "6A604-语音实验室(3)"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "艺术基础素养",
        "teacher": "翁朝霞",
        "room": "5A201"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "揭红兰",
        "room": "4C314"
      },
      {
        "day": "周二",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学语文",
        "teacher": "郑美平",
        "room": "5A404"
      },
      {
        "day": "周二",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学英语（1）",
        "teacher": "邱伟强",
        "room": "5B410"
      },
      {
        "day": "周四",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "林兴",
        "room": "5C314-商业银行营业厅3D实战演练"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "微观经济学B",
        "teacher": "杨秋鸾",
        "room": "5A205"
      },
      {
        "day": "周四",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "高等数学C",
        "teacher": "黄丽容",
        "room": "5A202"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "德法社会实践",
        "teacher": "黄佳作",
        "room": "9#501"
      },
      {
        "day": "周四",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "形势与政策（1）",
        "teacher": "曾正滋",
        "room": "4A406"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "人工智能导论",
        "teacher": "高晓",
        "room": "5C413"
      },
      {
        "day": "周四",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "财富管理专业群导论与认知（1）",
        "teacher": "张雷",
        "room": "5C314-商业银行营业厅3D实战演练"
      },
      {
        "day": "周五",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "劳动教育",
        "teacher": "林苾芾",
        "room": "5C103"
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "劳动教育",
        "teacher": "林苾芾",
        "room": "5C103"
      },
      {
        "day": "周五",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "高等数学C",
        "teacher": "黄丽容",
        "room": "9#301"
      },
      {
        "day": "周五",
        "period": "7-9节",
        "time": "14:30-17:00",
        "name": "形势与政策（1）",
        "teacher": "曾正滋",
        "room": "4A406"
      },
      {
        "day": "周五",
        "period": "9-10节",
        "time": "19:00-20:40",
        "name": "大学语文",
        "teacher": "郑美平",
        "room": "5B209"
      }
    ]
  },
  "25风景园林【本科】1班": {
    "major": "风景园林【本科】",
    "grade": "2025级",
    "courses": [
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "近现代史社会实践",
        "teacher": "江逸涵",
        "room": "9#501"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "高等数学D",
        "teacher": "郑淑霞",
        "room": "10#501"
      },
      {
        "day": "周一",
        "period": "1-2节",
        "time": "08:20-10:00",
        "name": "大学生职业生涯规划",
        "teacher": "林涛",
        "room": "11#515"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "中国近现代史纲要",
        "teacher": "江逸涵",
        "room": "10#411"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学生心理健康教育",
        "teacher": "李强",
        "room": "10#411"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "人工智能导论",
        "teacher": "关翔锋",
        "room": "11#320"
      },
      {
        "day": "周一",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "大学体育（1）",
        "teacher": "江晓敏",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "中国近现代史纲要",
        "teacher": "江逸涵",
        "room": "10#412"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学英语（1）",
        "teacher": "宋志强",
        "room": "6A605-语音实验室(4)"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "素描",
        "teacher": "林星彤",
        "room": "10#303（画室）"
      },
      {
        "day": "周一",
        "period": "3-4节",
        "time": "10:20-12:00",
        "name": "大学体育（1）",
        "teacher": "江晓敏",
        "room": "田径运动场"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "色彩",
        "teacher": "龚正",
        "room": "10#303（画室）"
      },
      {
        "day": "周一",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "设计基础",
        "teacher": "洪艳铌",
        "room": "10#306（绘图教室）"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "中国近现代史纲要",
        "teacher": "江逸涵",
        "room": "10#412"
      },
      {
        "day": "周一",
        "period": "7-8节",
        "time": "16:00-17:40",
        "name": "大学生职业生涯规划",
        "teacher": "林涛",
        "room": "11#515"
      },
      {
        "day": "周四",
        "period": "11-12节",
        "time": "19:00-20:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "军事理论",
        "teacher": "林夷",
        "room": "7号楼C201"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "素描",
        "teacher": "林星彤",
        "room": "10#303（画室）"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "色彩",
        "teacher": "龚正",
        "room": "10#303（画室）"
      },
      {
        "day": "周四",
        "period": "11-13节",
        "time": "20:50-22:30",
        "name": "设计基础",
        "teacher": "洪艳铌",
        "room": "10#306（绘图教室）"
      },
      {
        "day": "周四",
        "period": "7-10节",
        "time": "14:30-18:00",
        "name": "风景园林专业导论",
        "teacher": "杨真",
        "room": "10#407（梯形桌）"
      }
    ]
  }
}


@app.route("/")
def index():
    return render_template("index.html")


@app.route("/api/query", methods=["POST"])
def query_schedule():
    data = request.get_json()
    class_name = (data.get("class_name") or "").strip()
    if not class_name:
        return jsonify({"ok": False, "error": "请选择班级"}), 400
    schedule = SCHEDULES.get(class_name)
    if not schedule:
        return jsonify({"ok": False, "error": f"未找到班级「{class_name}"}), 404
    return jsonify({"ok": True, "class_name": class_name, **schedule})


@app.route("/api/classes", methods=["GET"])
def list_classes():
    return jsonify([{"name": k, "major": v["major"], "grade": v["grade"], "course_count": len(v["courses"])} for k, v in SCHEDULES.items()])


if __name__ == "__main__":
    app.run(host="0.0.0.0", port=5000, debug=False)
